[
  {
    "slug": "/introduction",
    "title": "Introduction to Weevio Cloud",
    "description": "Learn about Weevio Cloud, the comprehensive multi-tenant SaaS platform for PIMS management and integrations.",
    "content": "Weevio Cloud is a comprehensive multi-tenant SaaS platform designed to streamline PIMS management, customer engagement, and e-commerce operations for repair shops and service businesses.\n\n## What's Inside\n\nWeevio Cloud consists of five integrated applications:\n\n* **Store Management** - Manage orders, service repair orders (SROs), customers, and inventory\n* **Customer Portal** - Self-service portal for customers to track orders, pay invoices, and manage SROs\n* **Appointment Scheduler** - Embed appointment booking on your website with GSX integration\n* **GSX Integration** - Automated email workflows and appointment synchronization with Apple GSX\n* **Shopify Integration** - Sync inventory, orders, and enhance your store with variant selectors and cross-sell widgets\n\n## Get Started\n\n<AutoNavigationCards />\n",
    "_searchMeta": {
      "cleanContent": "weevio cloud is a comprehensive multi-tenant saas platform designed to streamline pims management customer engagement and e-commerce operations for repair shops and service businesses what s inside weevio cloud consists of five integrated applications: store management - manage orders service repair orders sros customers and inventory customer portal - self-service portal for customers to track orders pay invoices and manage sros appointment scheduler - embed appointment booking on your website with gsx integration gsx integration - automated email workflows and appointment synchronization with apple gsx shopify integration - sync inventory orders and enhance your store with variant selectors and cross-sell widgets get started autonavigationcards",
      "headings": [
        "What's Inside",
        "Get Started"
      ],
      "keywords": [
        "Weevio Cloud",
        "introduction",
        "overview",
        "PIMS",
        "What's Inside",
        "Get Started",
        "Store Management",
        "Customer Portal",
        "Appointment Scheduler",
        "GSX Integration",
        "Shopify Integration"
      ]
    }
  },
  {
    "slug": "/introduction/quick-start",
    "title": "Quick Start Guide",
    "description": "Get up and running with Weevio Cloud in minutes.",
    "content": "This guide will help you get started with Weevio Cloud quickly and efficiently.\n\n## Prerequisites\n\nBefore you begin, ensure you have:\n\n* Access to your Weevio Cloud account\n* PIMS Platinum/Gold credentials (if using PIMS integration)\n* Administrative access to your systems\n\n## Step 1: Account Setup\n\n1. Log in to your Weevio Cloud account\n2. Complete your organization profile\n3. Configure your basic settings\n\n## Step 2: Choose Your Apps\n\nSelect which Weevio Cloud applications you want to use:\n\n* **Store Management** - Start managing orders and customers\n* **Customer Portal** - Enable self-service for customers\n* **Appointment Scheduler** - Set up appointment booking\n* **GSX Integration** - Connect with Apple GSX\n* **Shopify Integration** - Link your Shopify store\n\n## Step 3: Configure Integrations\n\nSet up integrations based on your selected apps:\n\n* Configure PIMS connection\n* Set up GSX credentials (if applicable)\n* Connect your Shopify store (if applicable)\n\n## Step 4: Customize Settings\n\nAdjust settings to match your business needs:\n\n* Branding and appearance\n* Notification preferences\n* User permissions\n* Workflow automation\n\n## Next Steps\n\nExplore detailed documentation for each application:\n\n* [Store Management](/docs/store)\n* [Customer Portal](/docs/customer-portal)\n* [Appointment Scheduler](/docs/appointment-scheduler)\n* [GSX Integration](/docs/gsx)\n* [Shopify Integration](/docs/shopify)\n\n## Need Help?\n\nVisit our [Support](/docs/support) section or contact our team for assistance.\n",
    "_searchMeta": {
      "cleanContent": "this guide will help you get started with weevio cloud quickly and efficiently prerequisites before you begin ensure you have: access to your weevio cloud account pims platinum gold credentials if using pims integration administrative access to your systems step 1: account setup log in to your weevio cloud account complete your organization profile configure your basic settings step 2: choose your apps select which weevio cloud applications you want to use: store management - start managing orders and customers customer portal - enable self-service for customers appointment scheduler - set up appointment booking gsx integration - connect with apple gsx shopify integration - link your shopify store step 3: configure integrations set up integrations based on your selected apps: configure pims connection set up gsx credentials if applicable connect your shopify store if applicable step 4: customize settings adjust settings to match your business needs: branding and appearance notification preferences user permissions workflow automation next steps explore detailed documentation for each application: store management customer portal appointment scheduler gsx integration shopify integration need help visit our support section or contact our team for assistance",
      "headings": [
        "Prerequisites",
        "Step 1: Account Setup",
        "Step 2: Choose Your Apps",
        "Step 3: Configure Integrations",
        "Step 4: Customize Settings",
        "Next Steps",
        "Need Help?"
      ],
      "keywords": [
        "quick start",
        "getting started",
        "setup",
        "onboarding",
        "Prerequisites",
        "Step 1: Account Setup",
        "Step 2: Choose Your Apps",
        "Step 3: Configure Integrations",
        "Step 4: Customize Settings",
        "Next Steps",
        "Need Help?",
        "Store Management",
        "Customer Portal",
        "Appointment Scheduler",
        "GSX Integration",
        "Shopify Integration"
      ]
    }
  },
  {
    "slug": "/introduction/requirements",
    "title": "System Requirements",
    "description": "Technical requirements for using Weevio Cloud platform.",
    "content": "Learn about the technical requirements and compatibility for Weevio Cloud.\n\n## Browser Support\n\nWeevio Cloud supports the latest versions of:\n\n* Google Chrome (recommended)\n* Mozilla Firefox\n* Safari\n* Microsoft Edge\n\n## Network Requirements\n\n* Stable internet connection\n* HTTPS support\n* Ports 443 and 80 accessible\n\n## Integration Requirements\n\n### PIMS Integration\n\n* PIMS Platinum or PIMS Gold\n* Valid PIMS credentials\n* Network access to PIMS server\n\n### GSX Integration\n\n* Apple Authorized Service Provider status\n* Valid GSX credentials\n* GSX API access\n\n### Shopify Integration\n\n* Active Shopify store\n* Shopify admin access\n* API access permissions\n\n## Customer Portal Requirements\n\nFor customers accessing the portal:\n\n* Modern web browser\n* Email address for notifications\n* Mobile-responsive design support\n\n## Appointment Scheduler\n\nFor embedding on your website:\n\n* Website with ability to embed iframes or scripts\n* HTTPS-enabled website (recommended)\n\n## Security Requirements\n\n* TLS 1.2 or higher\n* Modern SSL certificates\n* Secure authentication methods\n\n## Performance Recommendations\n\nFor optimal performance:\n\n* Broadband internet connection (5 Mbps or higher)\n* Modern devices (released within last 5 years)\n* JavaScript enabled\n\n## Need Help?\n\nContact our [Support](/docs/support/contact) team if you have questions about compatibility.\n",
    "_searchMeta": {
      "cleanContent": "learn about the technical requirements and compatibility for weevio cloud browser support weevio cloud supports the latest versions of: google chrome recommended mozilla firefox safari microsoft edge network requirements stable internet connection https support ports 443 and 80 accessible integration requirements pims integration pims platinum or pims gold valid pims credentials network access to pims server gsx integration apple authorized service provider status valid gsx credentials gsx api access shopify integration active shopify store shopify admin access api access permissions customer portal requirements for customers accessing the portal: modern web browser email address for notifications mobile-responsive design support appointment scheduler for embedding on your website: website with ability to embed iframes or scripts https-enabled website recommended security requirements tls 1 2 or higher modern ssl certificates secure authentication methods performance recommendations for optimal performance: broadband internet connection 5 mbps or higher modern devices released within last 5 years javascript enabled need help contact our support team if you have questions about compatibility",
      "headings": [
        "Browser Support",
        "Network Requirements",
        "Integration Requirements",
        "Customer Portal Requirements",
        "Appointment Scheduler",
        "Security Requirements",
        "Performance Recommendations",
        "Need Help?"
      ],
      "keywords": [
        "requirements",
        "technical",
        "system",
        "compatibility",
        "Browser Support",
        "Network Requirements",
        "Integration Requirements",
        "Customer Portal Requirements",
        "Appointment Scheduler",
        "Security Requirements",
        "Performance Recommendations",
        "Need Help?"
      ]
    }
  },
  {
    "slug": "/introduction/what-is-weevio",
    "title": "What is Weevio Cloud?",
    "description": "Overview of Weevio Cloud platform capabilities and features.",
    "content": "Weevio Cloud is a comprehensive multi-tenant SaaS platform built to help repair shops and service businesses manage their operations more efficiently.\n\n## Key Features\n\n### Multi-Application Platform\n\nWeevio Cloud integrates five powerful applications:\n\n1. **Store Management** - Complete control over orders, SROs, customers, and inventory\n2. **Customer Portal** - Self-service capabilities for your customers\n3. **Appointment Scheduler** - Seamless appointment booking with GSX integration\n4. **GSX Integration** - Automated workflows for Apple authorized service providers\n5. **Shopify Integration** - E-commerce synchronization and enhancement tools\n\n## Platform Benefits\n\n* **Centralized Management** - All your business operations in one place\n* **Customer Self-Service** - Reduce support workload with portal access\n* **Seamless Integrations** - Connect with PIMS, GSX, and Shopify\n* **Automated Workflows** - Save time with email automation and sync features\n* **Multi-Tenant Architecture** - Scalable and secure for businesses of all sizes\n\n## Who is it For?\n\nWeevio Cloud is ideal for:\n\n* Apple Authorized Service Providers\n* Independent repair shops\n* Businesses using PIMS Platinum/Gold\n* Retailers with Shopify stores\n* Service businesses needing customer portals\n\n## Next Steps\n\nReady to get started? Check out the [Quick Start Guide](/docs/introduction/quick-start).\n",
    "_searchMeta": {
      "cleanContent": "weevio cloud is a comprehensive multi-tenant saas platform built to help repair shops and service businesses manage their operations more efficiently key features multi-application platform weevio cloud integrates five powerful applications: store management - complete control over orders sros customers and inventory customer portal - self-service capabilities for your customers appointment scheduler - seamless appointment booking with gsx integration gsx integration - automated workflows for apple authorized service providers shopify integration - e-commerce synchronization and enhancement tools platform benefits centralized management - all your business operations in one place customer self-service - reduce support workload with portal access seamless integrations - connect with pims gsx and shopify automated workflows - save time with email automation and sync features multi-tenant architecture - scalable and secure for businesses of all sizes who is it for weevio cloud is ideal for: apple authorized service providers independent repair shops businesses using pims platinum gold retailers with shopify stores service businesses needing customer portals next steps ready to get started check out the quick start guide",
      "headings": [
        "Key Features",
        "Platform Benefits",
        "Who is it For?",
        "Next Steps"
      ],
      "keywords": [
        "Weevio Cloud",
        "overview",
        "features",
        "platform",
        "Key Features",
        "Platform Benefits",
        "Who is it For?",
        "Next Steps",
        "Store Management",
        "Customer Portal",
        "Appointment Scheduler",
        "GSX Integration",
        "Shopify Integration",
        "Centralized Management",
        "Customer Self-Service",
        "Seamless Integrations",
        "Automated Workflows",
        "Multi-Tenant Architecture"
      ]
    }
  },
  {
    "slug": "/store",
    "title": "Weevio Store",
    "description": "Manage orders, track inventory, and streamline your retail operations with Weevio Cloud Store Management.",
    "content": "Weevio Store is the central hub for managing your retail operations. Built to integrate seamlessly with PIMS Platinum and Gold systems, it provides powerful tools for order management, customer tracking, and real-time inventory synchronization.\n\n## Overview\n\nWeevio Store transforms your PIMS system into a modern, cloud-based retail management platform. Whether you're processing in-store sales, managing online orders, or tracking customer interactions, Weevio Store gives you the tools you need to run your business efficiently.\n\n### Key Capabilities\n\n* **Order Management**: Create, edit, and track customer orders with real-time inventory validation\n* **PIMS Integration**: Automatic synchronization with your PIMS system ensures data consistency\n* **Multi-Channel Support**: Handle orders from multiple sales channels in one unified interface\n* **Customer Tracking**: Access complete customer history and information alongside orders\n* **Real-Time Updates**: Changes sync instantly between Weevio Store and your PIMS system\n\n## Core Features\n\n### Orders Management\n\nThe Orders module is your complete solution for managing customer transactions. From browsing order history to editing line items and processing returns, everything you need is in one place.\n\nLearn more about [Orders Management](/docs/store/orders) →\n\n### Additional Features\n\nWeevio Store includes additional powerful features (documentation coming soon):\n\n* **Service Repair Orders (SROs)**: Complete tracking and management of repair orders with status updates and customer communication\n* **Customer Management**: Comprehensive customer profiles with complete transaction history and contact management\n* **Inventory Management**: Real-time stock tracking, low inventory alerts, and product catalog management\n* **Reporting & Analytics**: Sales reports, customer insights, and business performance analytics\n\n## How It Works\n\n### PIMS Integration\n\nWeevio Store connects directly to your PIMS Platinum or Gold system through secure APIs. This integration provides:\n\n1. **Real-Time Sync**: Product data, pricing, and inventory levels stay current\n2. **Bidirectional Updates**: Changes made in Weevio Store or PIMS are reflected in both systems\n3. **Data Consistency**: Single source of truth for customer and order information\n4. **Automatic Backups**: All transactions are recorded in your PIMS database\n\n### Workflow Integration\n\nWeevio Store fits seamlessly into your existing operations:\n\n## Getting Started\n\n### Prerequisites\n\nBefore using Weevio Store, ensure you have:\n\n* Active Weevio Cloud account\n* PIMS Platinum system\n* API access credentials for your PIMS system\n* Stable internet connection for real-time synchronization\n\n### Quick Start\n\n## What's Next?\n\nReady to start managing your store? Begin with the [Orders Management](/docs/store/orders) guide to learn how to process customer transactions, manage inventory, and provide excellent customer service.\n",
    "_searchMeta": {
      "cleanContent": "weevio store is the central hub for managing your retail operations built to integrate seamlessly with pims platinum and gold systems it provides powerful tools for order management customer tracking and real-time inventory synchronization overview weevio store transforms your pims system into a modern cloud-based retail management platform whether you re processing in-store sales managing online orders or tracking customer interactions weevio store gives you the tools you need to run your business efficiently key capabilities order management: create edit and track customer orders with real-time inventory validation pims integration: automatic synchronization with your pims system ensures data consistency multi-channel support: handle orders from multiple sales channels in one unified interface customer tracking: access complete customer history and information alongside orders real-time updates: changes sync instantly between weevio store and your pims system core features orders management the orders module is your complete solution for managing customer transactions from browsing order history to editing line items and processing returns everything you need is in one place learn more about orders management additional features weevio store includes additional powerful features documentation coming soon : service repair orders sros : complete tracking and management of repair orders with status updates and customer communication customer management: comprehensive customer profiles with complete transaction history and contact management inventory management: real-time stock tracking low inventory alerts and product catalog management reporting analytics: sales reports customer insights and business performance analytics how it works pims integration weevio store connects directly to your pims platinum or gold system through secure apis this integration provides: real-time sync: product data pricing and inventory levels stay current bidirectional updates: changes made in weevio store or pims are reflected in both systems data consistency: single source of truth for customer and order information automatic backups: all transactions are recorded in your pims database workflow integration weevio store fits seamlessly into your existing operations: getting started prerequisites before using weevio store ensure you have: active weevio cloud account pims platinum system api access credentials for your pims system stable internet connection for real-time synchronization quick start what s next ready to start managing your store begin with the orders management guide to learn how to process customer transactions manage inventory and provide excellent customer service",
      "headings": [
        "Overview",
        "Core Features",
        "How It Works",
        "Getting Started",
        "What's Next?"
      ],
      "keywords": [
        "store",
        "orders",
        "sales",
        "inventory",
        "PIMS",
        "retail management",
        "Overview",
        "Core Features",
        "How It Works",
        "Getting Started",
        "What's Next?",
        "Order Management",
        "PIMS Integration",
        "Multi-Channel Support",
        "Customer Tracking",
        "Real-Time Updates",
        "Service Repair Orders (SROs)",
        "Customer Management",
        "Inventory Management",
        "Reporting & Analytics",
        "Real-Time Sync",
        "Bidirectional Updates",
        "Data Consistency",
        "Automatic Backups"
      ]
    }
  },
  {
    "slug": "/store/orders/customer-management",
    "title": "Customer Management",
    "description": "Select and manage customer information including billing and shipping details in orders.",
    "content": "Customer information is essential for processing orders in Weevio Store. This guide covers how to select customers, manage billing and shipping addresses, and handle various customer scenarios.\n\n## Overview\n\nEvery order in Weevio can be associated with a customer from your PIMS database. Customer information includes:\n\n* **Billing details**: Contact person, billing address, email, and phone\n* **Shipping details**: Shipping address and contact information\n* **Customer history**: Payment terms, pricing, and purchase history\n* **Multiple shipping locations**: Alternative delivery addresses\n\nWhen a customer is linked to an order, their information automatically populates billing and shipping fields, making order entry faster and more accurate.\n\n## Selecting Customers\n\n### Using Customer Search\n\nThe primary way to add a customer to an order is through the customer search feature:\n\n1. **Access Search**: In the Customer Billing or Customer Shipping tab, click the **Search** button next to the \"Name / Search\" field\n2. **Enter Search Terms**: Type any of the following:\n   * Customer code (e.g., \"CUST001\")\n   * Customer name (billing or shipping)\n   * Email address (billing or shipping)\n   * First or last name\n   * Phone number\n3. **Select Customer**: Click on a customer from the search results to link them to the order\n\n### Customer Search Fields\n\nThe customer search modal displays the following columns:\n\n| Column | Description |\n|--------|-------------|\n| Customer Code | Unique identifier from PIMS |\n| Billing Name | Company or customer name |\n| Billing Email | Primary email address |\n| Billing Phone | Primary phone number |\n| Business | Indicates if this is a business account |\n\n**Screenshot Placeholder**: Customer Search Modal showing search results\n\n### Quick Search via Name Field\n\nYou can also trigger customer search automatically:\n\n1. Type a customer name, email, or code directly into the **Name / Search** field\n2. When the field loses focus (on blur), if no customer is linked yet, the search modal opens automatically\n3. The search modal pre-populates with your entered text\n\nThis shortcut saves time when you know part of the customer's information.\n\n## Customer Information Display\n\n### Customer Billing Tab\n\nThe Customer Billing tab displays and allows editing of:\n\n**Contact Information**:\n\n* ATTN (Attention/Contact Person)\n* Email\n* Phone 1\n* Phone 2 (for SROs) or Fax (for Orders)\n\n**Billing Address**:\n\n* Address 1 (with USPS validation button)\n* Address 2\n* City\n* State\n* Postal Code\n* Country\n\n**Layout**:\n\nThe billing tab uses a two-column layout:\n\n* **Left column**: Name/search field and contact details\n* **Right column**: Address fields with validation\n\nAll fields update in real-time as you type and save automatically when you tab to the next field (for saved orders).\n\n### Customer Shipping Tab\n\nThe Customer Shipping tab mirrors the billing structure but focuses on delivery details:\n\n* **Shipping Name**: Company or recipient name\n* **ATTN**: Delivery contact person (for business addresses)\n* **Shipping Address**: Complete delivery address with USPS validation\n* **Shipping Contact**: Email and phone for delivery coordination\n\n## Billing Information\n\n### Editing Billing Details\n\nTo modify billing information:\n\n1. Navigate to the **Customer Billing** tab\n2. Click into any field to edit\n3. Make your changes\n4. Tab to the next field or click elsewhere to save\n\n**Field Behaviors**:\n\n* **ATTN (Attention)**: Contact person at the billing address\n* **Name**: Automatically populated from `BNAME` or `CUSTOMER_NAME`\n* **Email**: Primary contact email (used for invoices and receipts)\n* **Phone 1**: Primary phone number (automatically formatted)\n* **Phone 2/Fax**: Secondary contact number\n\n### Billing Address Validation\n\nWeevio includes USPS address validation:\n\n1. Enter or modify an address in the billing fields\n2. Click the **Validate Address** button next to Address 1\n3. The system validates the address against USPS database\n4. If validated successfully:\n   * Address fields update to standardized format\n   * Notifications appear for business addresses or vacant properties\n   * Order is automatically saved (if it has an order number)\n\n**Validation Messages**:\n\n* \"According to the USPS, this is a business address.\"\n* \"According to the USPS, this address is vacant.\"\n\n### Required Billing Fields\n\nWhile Weevio allows flexible data entry, certain fields improve order processing:\n\n| Field | Required | Notes |\n|-------|----------|-------|\n| Name | Recommended | Used for invoices and shipping labels |\n| Email | Recommended | Required for digital receipts |\n| Phone 1 | Optional | Helpful for delivery coordination |\n| Address 1 | Required for shipping | Must be validated for ship orders |\n| City | Required for shipping | Part of complete address |\n| State | Required for shipping | Used for tax calculations |\n| Postal Code | Required for shipping | Enables accurate shipping costs |\n\n## Shipping Information\n\n### Using Billing Address for Shipping\n\nBy default, shipping information mirrors billing information when you first link a customer. To keep them synchronized:\n\n1. Make changes in the **Customer Billing** tab\n2. The shipping fields automatically reflect customer defaults from PIMS\n3. To override, switch to **Customer Shipping** tab and make changes\n\n### Separate Shipping Address\n\nTo use a different shipping address:\n\n1. Navigate to the **Customer Shipping** tab\n2. Modify any shipping field as needed\n3. Changes save automatically when the field loses focus\n\n**Common Scenarios**:\n\n* Shipping to a different office or warehouse\n* Delivering to a customer's home vs. business\n* Special event or temporary location delivery\n\n### Using Shipping Locations\n\nMany customers have multiple pre-configured shipping locations in PIMS:\n\n1. Click the **Locations** button (map marker icon) in the order header\n2. The Shipping Locations modal displays all additional addresses for this customer\n3. Click on any location to apply it to the current order\n4. The shipping tab updates with the selected location's details\n\n**Shipping Locations Display**:\n\n| Column | Description |\n|--------|-------------|\n| Name | Location identifier |\n| Address 1 | Primary street address |\n| City | City name |\n| Zipcode | Postal code |\n| Phone | Contact number for this location |\n\n**Screenshot Placeholder**: Shipping Locations modal showing multiple addresses\n\n### Reverting to Primary Shipping Address\n\nIf you've selected an alternate shipping location and want to revert:\n\n1. Open the **Locations** modal\n2. Click the **Use Primary Shipping Address** button at the bottom\n3. Shipping fields reset to the customer's default PIMS shipping address\n\n### Shipping Contact Details\n\nFor shipping addresses, you can specify:\n\n* **ATTN**: Person receiving the shipment (shown only for business addresses)\n* **Email**: Delivery notification email\n* **Phone**: Contact number for delivery issues\n* **Phone 2** (SROs): Secondary contact\n\nThese details help carriers coordinate delivery and notify recipients.\n\n## Customer Sync & Validation\n\n### Syncing with PIMS\n\nWhen you link a customer to an order, Weevio performs several synchronization steps:\n\n1. **Fetch Customer Data**: Retrieves complete customer record from PIMS\n2. **Update Order Fields**: Populates billing and shipping information\n3. **Sync Line Items**: Updates pricing, discounts, and AppleCare based on customer\n4. **Recalculate Totals**: Applies customer-specific pricing and tax rules\n\n### Customer Refetch\n\nIf customer information changes in PIMS while you're editing an order:\n\n1. Another user updates customer details in PIMS\n2. Weevio detects the change via localStorage events\n3. The system automatically refetches customer data\n4. Your order updates with the latest information\n\nThis cross-window synchronization ensures data consistency.\n\n### Unlinking Customers\n\nTo remove a customer from an order:\n\n1. Click the **Unlink** button (yellow) next to the Search button\n2. Confirm the action\n3. All customer fields clear to blank values\n4. If the order is saved, PIMS is updated to remove the customer link\n\n**What happens when unlinking**:\n\n* `CUSTOMER_CODE` is cleared\n* All billing and shipping fields reset to empty\n* Purchase Order Number and Reference Number clear\n* Salesperson Code is preserved\n\n### Replacing Customers\n\nIf you need to change which customer is linked to an order:\n\n1. Search for and select a different customer\n2. Weevio displays a confirmation modal showing:\n   * Current customer information\n   * New customer you're selecting\n3. Choose **Replace** to confirm\n4. The system updates the order with new customer data\n5. Line items re-sync with new customer pricing\n\n## Validation Rules\n\n### Address Validation\n\nUSPS address validation performs the following checks:\n\n* **Standardization**: Converts addresses to USPS standard format\n* **Business Detection**: Identifies commercial addresses\n* **Vacancy Check**: Flags vacant properties\n* **Deliverability**: Verifies address can receive mail\n\n**Validation Triggers**:\n\n* Clicking the validation button next to Address 1\n* Automatic validation on blur (for some implementations)\n\n### Field-Level Validation\n\nWeevio performs automatic validation on customer fields:\n\n* **Email**: Must be valid email format (username@domain.com)\n* **Phone**: Automatically formatted (e.g., (555) 555-5555)\n* **Postal Code**: Must match country format\n\n### Required Fields\n\nFor different order types, certain fields are required:\n\n**Quotes and Worksheets**:\n\n* Customer Name (optional)\n* Minimal address information\n\n**Sales Orders**:\n\n* Customer Code (recommended)\n* Billing Name\n* Billing Email\n\n**Invoices**:\n\n* Customer Code (required for PIMS integration)\n* Complete billing address\n* Complete shipping address (if different)\n* Valid email for digital receipts\n\n## Special Cases\n\n### Walk-in Customers\n\nFor customers without PIMS records:\n\n1. Leave the customer search empty\n2. Manually enter billing and shipping information\n3. Create the order without linking a customer\n4. The order saves with entered information only\n\n**Limitations**:\n\n* No automatic pricing or discounts\n* No customer history tracking\n* Manual entry required for each order\n\n### Guest Checkout\n\nGuest checkout is similar to walk-in:\n\n1. Enter minimal customer information\n2. Focus on shipping address accuracy\n3. Collect email for order confirmation\n4. Skip customer code entry\n\n### Multiple Shipping Locations\n\nFor customers with many shipping locations:\n\n1. Link the customer first\n2. Open the **Locations** modal\n3. Use the filter/search to find specific location\n4. Select the appropriate shipping address\n\n**Tips for Multiple Locations**:\n\n* Locations are named descriptively (e.g., \"Main Warehouse\", \"Retail Store\")\n* Search by city, zipcode, or location name\n* The modal shows up to 2,500 locations\n* Use consistent naming in PIMS for easier searching\n\n### International Addresses\n\nFor customers outside the United States:\n\n1. Enter billing/shipping information as normal\n2. **Country field**: Specify the country name\n3. **State field**: Use province or region as appropriate\n4. **Postal Code**: Use format appropriate for the country\n5. **USPS Validation**: Skip validation (only works for US addresses)\n\n**International Field Tips**:\n\n* Use full country names (e.g., \"Canada\" not \"CA\")\n* State field accepts any text for international addresses\n* Phone numbers: Include country code (e.g., \"+1 (555) 555-5555\")\n\n### Business vs. Individual Customers\n\nThe system handles business and individual customers differently:\n\n**Business Customers** (`BUSINESS_OR_INDIVIDUAL = true`):\n\n* Display ATTN field in both billing and shipping tabs\n* ATTN is the contact person name\n* Name field is company name\n\n**Individual Customers**:\n\n* Hide ATTN field (in some views)\n* Name field combines FIRST\\_NAME and LAST\\_NAME\n* Simpler contact information\n\n### Updating Existing Customer Information\n\nIf you notice customer information is outdated while creating an order:\n\n1. **For minor corrections**: Edit fields directly in the order\n2. **For major updates**:\n   * Navigate to POS > Customers\n   * Search for the customer\n   * Update their master record in PIMS\n   * Return to your order\n   * The system refetches updated data\n\n## Viewing Customer Details\n\n### Customer Button\n\nOnce a customer is linked to an order:\n\n1. Look for the **Customer** button (user icon) in the order header\n2. Click to open the customer's full profile in a new window\n3. View complete customer history, notes, and details\n4. The original order remains open in your current window\n\nThis allows you to reference customer information while building the order.\n\n### Customer Code Display\n\nThe customer code appears in multiple places:\n\n* **Order Header**: In the customer tabs area\n* **Customer Search**: When searching for customers\n* **Shipping Locations**: Associated with each location\n\nCustomer codes are unique identifiers in PIMS and should be used for accurate record-keeping.\n\n## Troubleshooting\n\n### Customer Search Returns No Results\n\n**Problem**: Searching for a customer returns no results.\n\n**Solutions**:\n\n1. Try different search terms (name, email, customer code)\n2. Check for typos or extra spaces\n3. Verify the customer exists in PIMS\n4. Try searching by partial information\n5. Check if customer is in the correct organization/location\n\n### Customer Information Won't Save\n\n**Problem**: Edits to customer fields don't persist.\n\n**Solutions**:\n\n1. **Check Order Status**: Ensure the order has been saved (has an ORDER\\_NUMBER)\n2. **Check Editability**: Verify the order is not locked or paid\n3. **Network Issues**: Check your internet connection to PIMS\n4. **Field Focus**: Make sure to tab out of fields to trigger save\n5. **Permissions**: Verify you have edit permissions for this order type\n\n### Shipping Location Not Applying\n\n**Problem**: Selecting a shipping location doesn't update the order.\n\n**Solutions**:\n\n1. Click the location row in the modal (don't just select it)\n2. Wait for the modal to close before checking shipping tab\n3. Refresh the order if changes don't appear\n4. Verify the location has complete address information in PIMS\n\n### Address Validation Fails\n\n**Problem**: USPS validation returns an error or doesn't recognize the address.\n\n**Solutions**:\n\n1. **Rural Addresses**: Some rural routes may not validate\n2. **New Construction**: Recent addresses may not be in USPS database yet\n3. **Format Issues**: Try entering address without abbreviations\n4. **PO Boxes**: Use standard format \"PO Box 123\"\n5. **Manual Entry**: You can skip validation and enter manually if needed\n\n### Customer Code Already Linked\n\n**Problem**: Trying to link a customer but getting a warning.\n\n**Solutions**:\n\n1. Check if customer is already linked (look for customer code in fields)\n2. Use **Unlink** button to remove current customer first\n3. Use **Replace** option if prompted to confirm customer change\n4. Verify you're working with the correct order\n\n### Duplicate Customer Records\n\n**Problem**: Search shows multiple entries for the same customer.\n\n**Solutions**:\n\n1. Check customer codes to identify the primary record\n2. Use the most recent or most complete record\n3. Note duplicate codes and report to PIMS administrator\n4. Verify with customer which record is correct\n5. In PIMS, merge duplicate customer records\n\n### Missing Shipping Locations\n\n**Problem**: Customer should have multiple locations but modal shows none.\n\n**Solutions**:\n\n1. Verify locations are set up in PIMS customer record\n2. Check that locations are in the `CUSTOMERS_ADDITIONAL_LOCATIONS` sub-records\n3. Ensure customer code is correct\n4. Refresh the order and try again\n5. Add missing locations in PIMS if needed\n\n## Best Practices\n\n### Customer Linking\n\n1. **Link customers early**: Search and link customers before adding line items\n2. **Verify customer**: Double-check customer name and code before proceeding\n3. **Update information**: Correct any outdated customer details as you go\n4. **Use customer codes**: When possible, search by customer code for accuracy\n\n### Address Management\n\n1. **Validate addresses**: Always use USPS validation for shipping orders\n2. **Complete information**: Fill in all address fields, even optional ones\n3. **Shipping locations**: Use pre-configured locations instead of manual entry\n4. **International addresses**: Be extra careful with format and country codes\n\n### Order Efficiency\n\n1. **Batch similar orders**: Link the same customer across multiple orders\n2. **Save frequently**: Save orders after linking customers to trigger sync\n3. **Use keyboard**: Tab through fields instead of clicking for faster entry\n4. **Shortcuts**: Use quick search by typing in name field\n\n### Data Quality\n\n1. **Consistent formatting**: Use same format for phone numbers, addresses\n2. **Complete records**: Fill in email and phone even if not required\n3. **Update PIMS**: Fix customer data in PIMS, not just in orders\n4. **Report issues**: Note any data quality problems for administrator review\n\n## Related Documentation\n\n* [Order View Overview](/docs/store/orders/order-view-overview) - Understanding the Order View interface\n* [Line Items](/docs/store/orders/line-items) - Managing line items in orders\n* [Customer Management](/docs/store/customers) - Managing customer master records in Weevio Store\n\n{/* Additional documentation coming soon: Creating Orders, Order Header, and Order Finalization */}\n",
    "_searchMeta": {
      "cleanContent": "customer information is essential for processing orders in weevio store this guide covers how to select customers manage billing and shipping addresses and handle various customer scenarios overview every order in weevio can be associated with a customer from your pims database customer information includes: billing details: contact person billing address email and phone shipping details: shipping address and contact information customer history: payment terms pricing and purchase history multiple shipping locations: alternative delivery addresses when a customer is linked to an order their information automatically populates billing and shipping fields making order entry faster and more accurate selecting customers using customer search the primary way to add a customer to an order is through the customer search feature: access search: in the customer billing or customer shipping tab click the search button next to the name search field enter search terms: type any of the following: customer code e g cust001 customer name billing or shipping email address billing or shipping first or last name phone number select customer: click on a customer from the search results to link them to the order customer search fields the customer search modal displays the following columns: column description-------- -------------customer code unique identifier from pimsbilling name company or customer namebilling email primary email addressbilling phone primary phone numberbusiness indicates if this is a business account screenshot placeholder: customer search modal showing search results quick search via name field you can also trigger customer search automatically: type a customer name email or code directly into the name search field when the field loses focus on blur if no customer is linked yet the search modal opens automatically the search modal pre-populates with your entered text this shortcut saves time when you know part of the customer s information customer information display customer billing tab the customer billing tab displays and allows editing of: contact information: attn attention contact person email phone 1 phone 2 for sros or fax for orders billing address: address 1 with usps validation button address 2 city state postal code country layout: the billing tab uses a two-column layout: left column: name search field and contact details right column: address fields with validation all fields update in real-time as you type and save automatically when you tab to the next field for saved orders customer shipping tab the customer shipping tab mirrors the billing structure but focuses on delivery details: shipping name: company or recipient name attn: delivery contact person for business addresses shipping address: complete delivery address with usps validation shipping contact: email and phone for delivery coordination billing information editing billing details to modify billing information: navigate to the customer billing tab click into any field to edit make your changes tab to the next field or click elsewhere to save field behaviors: attn attention : contact person at the billing address name: automatically populated from bname or customer_name email: primary contact email used for invoices and receipts phone 1: primary phone number automatically formatted phone 2 fax: secondary contact number billing address validation weevio includes usps address validation: enter or modify an address in the billing fields click the validate address button next to address 1 the system validates the address against usps database if validated successfully: address fields update to standardized format notifications appear for business addresses or vacant properties order is automatically saved if it has an order number validation messages: according to the usps this is a business address according to the usps this address is vacant required billing fields while weevio allows flexible data entry certain fields improve order processing: field required notes------- ---------- -------name recommended used for invoices and shipping labelsemail recommended required for digital receiptsphone 1 optional helpful for delivery coordinationaddress 1 required for shipping must be validated for ship orderscity required for shipping part of complete addressstate required for shipping used for tax calculationspostal code required for shipping enables accurate shipping costs shipping information using billing address for shipping by default shipping information mirrors billing information when you first link a customer to keep them synchronized: make changes in the customer billing tab the shipping fields automatically reflect customer defaults from pims to override switch to customer shipping tab and make changes separate shipping address to use a different shipping address: navigate to the customer shipping tab modify any shipping field as needed changes save automatically when the field loses focus common scenarios: shipping to a different office or warehouse delivering to a customer s home vs business special event or temporary location delivery using shipping locations many customers have multiple pre-configured shipping locations in pims: click the locations button map marker icon in the order header the shipping locations modal displays all additional addresses for this customer click on any location to apply it to the current order the shipping tab updates with the selected location s details shipping locations display: column description-------- -------------name location identifieraddress 1 primary street addresscity city namezipcode postal codephone contact number for this location screenshot placeholder: shipping locations modal showing multiple addresses reverting to primary shipping address if you ve selected an alternate shipping location and want to revert: open the locations modal click the use primary shipping address button at the bottom shipping fields reset to the customer s default pims shipping address shipping contact details for shipping addresses you can specify: attn: person receiving the shipment shown only for business addresses email: delivery notification email phone: contact number for delivery issues phone 2 sros : secondary contact these details help carriers coordinate delivery and notify recipients customer sync validation syncing with pims when you link a customer to an order weevio performs several synchronization steps: fetch customer data: retrieves complete customer record from pims update order fields: populates billing and shipping information sync line items: updates pricing discounts and applecare based on customer recalculate totals: applies customer-specific pricing and tax rules customer refetch if customer information changes in pims while you re editing an order: another user updates customer details in pims weevio detects the change via localstorage events the system automatically refetches customer data your order updates with the latest information this cross-window synchronization ensures data consistency unlinking customers to remove a customer from an order: click the unlink button yellow next to the search button confirm the action all customer fields clear to blank values if the order is saved pims is updated to remove the customer link what happens when unlinking: customer_code is cleared all billing and shipping fields reset to empty purchase order number and reference number clear salesperson code is preserved replacing customers if you need to change which customer is linked to an order: search for and select a different customer weevio displays a confirmation modal showing: current customer information new customer you re selecting choose replace to confirm the system updates the order with new customer data line items re-sync with new customer pricing validation rules address validation usps address validation performs the following checks: standardization: converts addresses to usps standard format business detection: identifies commercial addresses vacancy check: flags vacant properties deliverability: verifies address can receive mail validation triggers: clicking the validation button next to address 1 automatic validation on blur for some implementations field-level validation weevio performs automatic validation on customer fields: email: must be valid email format username domain com phone: automatically formatted e g 555 555-5555 postal code: must match country format required fields for different order types certain fields are required: quotes and worksheets: customer name optional minimal address information sales orders: customer code recommended billing name billing email invoices: customer code required for pims integration complete billing address complete shipping address if different valid email for digital receipts special cases walk-in customers for customers without pims records: leave the customer search empty manually enter billing and shipping information create the order without linking a customer the order saves with entered information only limitations: no automatic pricing or discounts no customer history tracking manual entry required for each order guest checkout guest checkout is similar to walk-in: enter minimal customer information focus on shipping address accuracy collect email for order confirmation skip customer code entry multiple shipping locations for customers with many shipping locations: link the customer first open the locations modal use the filter search to find specific location select the appropriate shipping address tips for multiple locations: locations are named descriptively e g main warehouse retail store search by city zipcode or location name the modal shows up to 2 500 locations use consistent naming in pims for easier searching international addresses for customers outside the united states: enter billing shipping information as normal country field: specify the country name state field: use province or region as appropriate postal code: use format appropriate for the country usps validation: skip validation only works for us addresses international field tips: use full country names e g canada not ca state field accepts any text for international addresses phone numbers: include country code e g 1 555 555-5555 business vs individual customers the system handles business and individual customers differently: business customers businessorindividual true : display attn field in both billing and shipping tabs attn is the contact person name name field is company name individual customers: hide attn field in some views name field combines first name and last name simpler contact information updating existing customer information if you notice customer information is outdated while creating an order: for minor corrections: edit fields directly in the order for major updates: navigate to pos customers search for the customer update their master record in pims return to your order the system refetches updated data viewing customer details customer button once a customer is linked to an order: look for the customer button user icon in the order header click to open the customer s full profile in a new window view complete customer history notes and details the original order remains open in your current window this allows you to reference customer information while building the order customer code display the customer code appears in multiple places: order header: in the customer tabs area customer search: when searching for customers shipping locations: associated with each location customer codes are unique identifiers in pims and should be used for accurate record-keeping troubleshooting customer search returns no results problem: searching for a customer returns no results solutions: try different search terms name email customer code check for typos or extra spaces verify the customer exists in pims try searching by partial information check if customer is in the correct organization location customer information won t save problem: edits to customer fields don t persist solutions: check order status: ensure the order has been saved has an order _number check editability: verify the order is not locked or paid network issues: check your internet connection to pims field focus: make sure to tab out of fields to trigger save permissions: verify you have edit permissions for this order type shipping location not applying problem: selecting a shipping location doesn t update the order solutions: click the location row in the modal don t just select it wait for the modal to close before checking shipping tab refresh the order if changes don t appear verify the location has complete address information in pims address validation fails problem: usps validation returns an error or doesn t recognize the address solutions: rural addresses: some rural routes may not validate new construction: recent addresses may not be in usps database yet format issues: try entering address without abbreviations po boxes: use standard format po box 123 manual entry: you can skip validation and enter manually if needed customer code already linked problem: trying to link a customer but getting a warning solutions: check if customer is already linked look for customer code in fields use unlink button to remove current customer first use replace option if prompted to confirm customer change verify you re working with the correct order duplicate customer records problem: search shows multiple entries for the same customer solutions: check customer codes to identify the primary record use the most recent or most complete record note duplicate codes and report to pims administrator verify with customer which record is correct in pims merge duplicate customer records missing shipping locations problem: customer should have multiple locations but modal shows none solutions: verify locations are set up in pims customer record check that locations are in the customersadditionallocations sub-records ensure customer code is correct refresh the order and try again add missing locations in pims if needed best practices customer linking link customers early: search and link customers before adding line items verify customer: double-check customer name and code before proceeding update information: correct any outdated customer details as you go use customer codes: when possible search by customer code for accuracy address management validate addresses: always use usps validation for shipping orders complete information: fill in all address fields even optional ones shipping locations: use pre-configured locations instead of manual entry international addresses: be extra careful with format and country codes order efficiency batch similar orders: link the same customer across multiple orders save frequently: save orders after linking customers to trigger sync use keyboard: tab through fields instead of clicking for faster entry shortcuts: use quick search by typing in name field data quality consistent formatting: use same format for phone numbers addresses complete records: fill in email and phone even if not required update pims: fix customer data in pims not just in orders report issues: note any data quality problems for administrator review related documentation order view overview - understanding the order view interface line items - managing line items in orders customer management - managing customer master records in weevio store additional documentation coming soon: creating orders order header and order finalization",
      "headings": [
        "Overview",
        "Selecting Customers",
        "Customer Information Display",
        "Billing Information",
        "Shipping Information",
        "Customer Sync & Validation",
        "Validation Rules",
        "Special Cases",
        "Viewing Customer Details",
        "Troubleshooting",
        "Best Practices",
        "Related Documentation"
      ],
      "keywords": [
        "customers",
        "billing",
        "shipping",
        "addresses",
        "customer lookup",
        "customer search",
        "Overview",
        "Selecting Customers",
        "Customer Information Display",
        "Billing Information",
        "Shipping Information",
        "Customer Sync & Validation",
        "Validation Rules",
        "Special Cases",
        "Viewing Customer Details",
        "Troubleshooting",
        "Best Practices",
        "Related Documentation",
        "Billing details",
        "Shipping details",
        "Customer history",
        "Multiple shipping locations",
        "Access Search",
        "Search",
        "Enter Search Terms",
        "Select Customer",
        "Screenshot Placeholder",
        "Name / Search",
        "Contact Information",
        "Billing Address",
        "Layout",
        "Left column",
        "Right column",
        "Shipping Name",
        "ATTN",
        "Shipping Address",
        "Shipping Contact",
        "Customer Billing",
        "Field Behaviors",
        "ATTN (Attention)",
        "Name",
        "Email",
        "Phone 1",
        "Phone 2/Fax",
        "Validate Address",
        "Validation Messages",
        "Customer Shipping",
        "Common Scenarios",
        "Locations",
        "Shipping Locations Display",
        "Use Primary Shipping Address",
        "Phone",
        "Phone 2",
        "Fetch Customer Data",
        "Update Order Fields",
        "Sync Line Items",
        "Recalculate Totals",
        "Unlink",
        "What happens when unlinking",
        "Replace",
        "Standardization",
        "Business Detection",
        "Vacancy Check",
        "Deliverability",
        "Validation Triggers",
        "Postal Code",
        "Quotes and Worksheets",
        "Sales Orders",
        "Invoices",
        "Limitations",
        "Tips for Multiple Locations",
        "Country field",
        "State field",
        "USPS Validation",
        "International Field Tips",
        "Business Customers",
        "Individual Customers",
        "For minor corrections",
        "For major updates",
        "Customer",
        "Order Header",
        "Customer Search",
        "Shipping Locations",
        "Problem",
        "Solutions",
        "Check Order Status",
        "Check Editability",
        "Network Issues",
        "Field Focus",
        "Permissions",
        "Rural Addresses",
        "New Construction",
        "Format Issues",
        "PO Boxes",
        "Manual Entry",
        "Link customers early",
        "Verify customer",
        "Update information",
        "Use customer codes",
        "Validate addresses",
        "Complete information",
        "Shipping locations",
        "International addresses",
        "Batch similar orders",
        "Save frequently",
        "Use keyboard",
        "Shortcuts",
        "Consistent formatting",
        "Complete records",
        "Update PIMS",
        "Report issues",
        "BNAME",
        "CUSTOMER_NAME",
        "CUSTOMER_CODE",
        "BUSINESS_OR_INDIVIDUAL = true",
        "CUSTOMERS_ADDITIONAL_LOCATIONS"
      ]
    }
  },
  {
    "slug": "/store/orders",
    "title": "Orders",
    "description": "Manage and track customer orders in Weevio Cloud Store Management.",
    "content": "The Orders module is the central hub for managing all customer transactions in Weevio Cloud. From browsing order history to editing line items and managing customer information, this powerful interface gives you complete control over your sales operations.\n\n## Overview\n\nThe Orders system provides a comprehensive view of all transactions, allowing you to:\n\n* **Browse and search** orders with advanced filtering and sorting\n* **View detailed order information** including items, pricing, and customer details\n* **Edit and update** line items, quantities, and pricing\n* **Manage customer information** directly from the order view\n* **Track order status** and fulfillment progress\n* **Generate reports** and export order data\n\n## Key Features\n\n### Unified Order Management\n\nAll orders from every sales channel (in-store, online, phone orders) are consolidated in one place, making it easy to track and manage your entire sales operation.\n\n### Real-Time Updates\n\nOrders sync automatically with your PIMS system, ensuring inventory levels and pricing are always accurate across all platforms.\n\n### Flexible Editing\n\nMake changes to orders on the fly - adjust quantities, add or remove items, apply discounts, and update customer information without leaving the order view.\n\n### Customer Context\n\nAccess complete customer history and information directly from any order, making it easy to provide personalized service and resolve issues quickly.\n\n## Order Management Sections\n\n## Tips and Shortcuts\n\n## Next Steps\n\nReady to dive deeper into order management? Explore the detailed guides for each section:\n\n* Learn about advanced search and filtering in [Order Table](/docs/store/orders/order-table)\n* Understand the complete order interface in [Order View Overview](/docs/store/orders/order-view-overview)\n* Master product management in [Line Items](/docs/store/orders/line-items)\n* Manage customer relationships in [Customer Management](/docs/store/orders/customer-management)\n",
    "_searchMeta": {
      "cleanContent": "the orders module is the central hub for managing all customer transactions in weevio cloud from browsing order history to editing line items and managing customer information this powerful interface gives you complete control over your sales operations overview the orders system provides a comprehensive view of all transactions allowing you to: browse and search orders with advanced filtering and sorting view detailed order information including items pricing and customer details edit and update line items quantities and pricing manage customer information directly from the order view track order status and fulfillment progress generate reports and export order data key features unified order management all orders from every sales channel in-store online phone orders are consolidated in one place making it easy to track and manage your entire sales operation real-time updates orders sync automatically with your pims system ensuring inventory levels and pricing are always accurate across all platforms flexible editing make changes to orders on the fly - adjust quantities add or remove items apply discounts and update customer information without leaving the order view customer context access complete customer history and information directly from any order making it easy to provide personalized service and resolve issues quickly order management sections tips and shortcuts next steps ready to dive deeper into order management explore the detailed guides for each section: learn about advanced search and filtering in order table understand the complete order interface in order view overview master product management in line items manage customer relationships in customer management",
      "headings": [
        "Overview",
        "Key Features",
        "Order Management Sections",
        "Tips and Shortcuts",
        "Next Steps"
      ],
      "keywords": [
        "orders",
        "sales",
        "tracking",
        "management",
        "Overview",
        "Key Features",
        "Order Management Sections",
        "Tips and Shortcuts",
        "Next Steps",
        "Browse and search",
        "View detailed order information",
        "Edit and update",
        "Manage customer information",
        "Track order status",
        "Generate reports"
      ]
    }
  },
  {
    "slug": "/store/orders/line-items",
    "title": "Line Items Management",
    "description": "Add, edit, and manage line items in orders including pricing, quantities, and inventory checks.",
    "content": "Line items represent individual products or parts added to an order. Each line item contains product details, pricing, quantities, and inventory information. This guide covers how to add, edit, and manage line items in your orders.\n\n## Overview\n\n### What are Line Items?\n\nLine items are the individual products or parts within an order. Each line item includes:\n\n* **Part Number**: Unique identifier for the product\n* **Description**: Product name and details\n* **Quantity**: Amount ordered\n* **Shipped Quantity**: Amount fulfilled\n* **Price**: Unit and extended pricing\n* **Stock Information**: Available inventory\n* **Backorder Status**: Items on backorder\n\n### Line Item Table Columns\n\n| Column | Description |\n|--------|-------------|\n| **Line #** | Sequential line number (auto-assigned) |\n| **Part / Search** | Part number entry field with inventory search |\n| **Description** | Product name and description (editable) |\n| **Quantity** | Amount ordered |\n| **Shipped** | Amount fulfilled/shipped |\n| **Stock** | On-hand quantity at current location |\n| **Backorder** | Items on backorder (appears as gray badge) |\n| **Discount** | Price code/discount link (when applicable) |\n| **No Tax** | Tax exemption toggle |\n| **Price** | Unit price |\n| **Extended** | Total price (Quantity × Price) |\n| **Actions** | Line item menu (serial numbers, delete) |\n\n## Adding Line Items\n\n### Method 1: Manual Part Number Entry\n\n<Note type=\"tip\">\n  **Quick Tip**: The part number field is case-insensitive. \"ABC123\" and \"abc123\" will find the same part.\n</Note>\n\n### Method 2: Scanning Part Codes\n\n### Method 3: Searching Inventory\n\n<Note type=\"info\">\n  **Search Behavior**: The search automatically excludes discontinued parts unless they have stock available. This prevents adding parts that cannot be fulfilled.\n</Note>\n\n### Method 4: Manual Entry Without Part Number\n\nYou can add line items without a part number for custom or one-off items:\n\n<Note type=\"warning\">\n  **Important**: Line items without part numbers:\n\n  * Do not adjust inventory\n  * Do not check stock availability\n  * Cannot have serial numbers assigned\n  * May require manual tax calculation\n</Note>\n\n## Editing Line Items\n\n### Changing Quantities\n\n### Changing Shipped Quantities\n\nFor Sales Orders and Invoices, you can adjust how many items are fulfilled:\n\n<Note type=\"warning\">\n  **Validation Rules**:\n\n  * Shipped quantity cannot exceed ordered quantity\n  * For items requiring inventory adjustment, shipped quantity cannot exceed available stock\n  * The system shows an inventory mismatch modal if you try to ship more than available\n</Note>\n\n### Editing Descriptions\n\n### Applying Discounts\n\nWhen a part has available price codes, a discount link appears in the **Discount** column:\n\n<Note type=\"info\">\n  **Price Code Inheritance**: If a customer has a default price code, it's automatically applied to new line items. You can override it with a different code using the discount link.\n</Note>\n\n### Toggling Tax Status\n\n## Inventory Integration\n\n### Stock Quantity Display\n\nThe **Stock** column shows the on-hand quantity at your current location. This updates in real-time when:\n\n* Adding a new part\n* Changing locations\n* After other orders are processed\n\n### Inventory Mismatch Handling\n\nWhen you try to ship more items than available stock, the system displays an **Inventory Mismatch** modal:\n\n**Example Scenario**:\n\n* Customer orders 10 units (Quantity: 10)\n* You have 6 in stock (Stock: 6)\n* System calculates: 4 units not stocked\n\n**Solution**:\n\n* Set Shipped: 6\n* Set Backorder: 4\n* Quantity remains: 10\n* Click Continue\n\n### Stock Update Modal\n\nWhen converting an order (e.g., Quote to Sales Order), you may see the **Update from Stock** modal:\n\n<Note type=\"tip\">\n  **Recommended**: Use \"Yes\" when converting quotes to orders, then manually adjust any lines that need special handling. This ensures shipped quantities reflect current inventory.\n</Note>\n\n### Multiple Location Support\n\nIf you switch locations while editing an order:\n\n* Stock quantities refresh for the new location\n* Previously loaded parts show updated on-hand amounts\n* The system validates quantities against the new location's inventory\n\n## Line Item Actions\n\n### Removing Line Items\n\n<Note type=\"warning\">\n  **Important**: Deleting a line item:\n\n  * Cannot be undone\n  * Removes associated serial numbers\n  * Deletes auto-loaded AppleCare coverage (if applicable)\n  * Updates inventory allocations immediately\n</Note>\n\n### Managing Serial Numbers\n\nFor parts that require serial number tracking, the Actions menu includes a **Serials** option.\n\n<Note type=\"info\">\n  **When Serials Appear**: The Serials option only appears for:\n\n  * Parts marked as requiring serial numbers in inventory\n  * Sales Orders and Invoices (not Worksheets or Quotes)\n  * Lines with a shipped quantity greater than 0\n</Note>\n\n### AppleCare Management\n\nFor Apple products eligible for AppleCare, the Actions menu includes an **AppleCare** option.\n\n## Understanding Line Item Fields\n\n### Part Number vs Description\n\n* **Part Number**: Immutable once saved. Must match an inventory record (unless blank).\n* **Product Name/Description**: Editable even after loading from inventory. Use for custom notes or variations.\n\n### Price Fields\n\n**Unit Price**:\n\n* Loaded from inventory record\n* Can be overridden with price codes\n* Editable only for line items without a part number\n\n**Extended Price**:\n\n* Automatically calculated as Quantity × Unit Price\n* Updates in real-time when quantity or price changes\n* Shown in bold in the Extended column\n\n### Quantity vs Shipped\n\n**Quantity**: Total amount ordered by the customer\n\n**Shipped**: Amount being fulfilled in this transaction\n\n**Backorder**: Calculated as Quantity - Shipped (shown in Backorder column)\n\n**Worksheet/Quote Behavior**: Shipped always equals Quantity (no backorders)\n\n**Sales Order/Invoice Behavior**: Shipped can be less than Quantity, creating backorders\n\n### Cost vs Price\n\n* **Cost**: Your cost from vendor (not visible in line item table)\n* **Price**: Selling price to customer (visible in Price column)\n* **List Price**: MSRP or retail price (stored but not displayed)\n\n## Validation and Error Handling\n\n### Common Validation Errors\n\n#### \"Part not found\"\n\n**Cause**: The part number doesn't exist in inventory at your current location.\n\n**Solution**:\n\n* Double-check the part code spelling\n* Verify the part exists in your location's inventory\n* Use the inventory search modal to browse available parts\n* Add the part to inventory first if it's a new item\n\n#### \"Inventory Mismatch\"\n\n**Cause**: Trying to ship more items than available in stock.\n\n**Solution**:\n\n* Use the Inventory Mismatch modal to balance shipped and backorder quantities\n* Reduce the shipped quantity to match available stock\n* Increase backorder quantity to account for the shortage\n* Verify stock levels in the inventory module\n\n#### \"Shipped quantity exceeds ordered quantity\"\n\n**Cause**: The number in the Shipped field is greater than the Quantity field.\n\n**Solution**:\n\n* Reduce shipped quantity to match or be less than the ordered quantity\n* Increase the ordered quantity if the customer wants more items\n* Check for data entry errors\n\n#### \"Empty value cannot be updated\"\n\n**Cause**: Attempting to save a line with blank required fields.\n\n**Solution**:\n\n* Enter a quantity value (cannot be blank)\n* For custom items, ensure description and price are filled in\n* Use 0 for shipped if no items are being fulfilled yet\n\n#### \"AppleCare parts can't be modified\"\n\n**Cause**: Trying to edit an auto-loaded AppleCare line item.\n\n**Solution**:\n\n* AppleCare lines are auto-generated and protected from editing\n* Modify the parent device line item instead\n* Use the AppleCare action menu to adjust coverage\n* Delete and re-add the parent item if major changes are needed\n\n### Error Recovery\n\n#### Undoing Quantity Changes\n\nIf you enter an invalid quantity:\n\n#### Recovering from Loading Errors\n\nIf a part fails to load:\n\n## Special Line Item Types\n\n### AppleCare Products\n\nAppleCare line items are automatically added when you configure coverage for eligible devices:\n\n**Characteristics**:\n\n* Cannot be manually edited (quantity, price, description locked)\n* Linked to a parent device line item\n* Automatically deleted if parent device is removed\n* Show \"AppleCare parts can't be modified\" tooltip when clicked\n\n**Management**: Use the AppleCare action menu on the parent device to modify coverage.\n\n### Parts Not in Inventory\n\nLine items without a part number:\n\n**Characteristics**:\n\n* Price field becomes editable\n* No stock quantity shown\n* No inventory adjustments occur\n* Cannot have serial numbers\n* Useful for services, one-time items, or special orders\n\n**Best Practice**: Add a detailed description since there's no inventory record to reference.\n\n### Discontinued Parts with Stock\n\nDiscontinued parts appear in search results only if stock is available:\n\n**Characteristics**:\n\n* Can be added to orders while stock lasts\n* Stock quantity is accurate\n* May have limited or no pricing information\n* Description may indicate \"Discontinued\"\n\n**Recommendation**: Notify customers that the part is discontinued and may not be available for future orders.\n\n## Keyboard Shortcuts and Quick Actions\n\n### Navigation\n\n* **Tab**: Move to next field (and trigger save for quantities)\n* **Shift+Tab**: Move to previous field\n* **Enter**: Load part number (in Part field only)\n* **Escape**: Close search modal\n\n### Quick Entry Workflow\n\nFor fast order entry, use this pattern:\n\n1. Click Part Number field\n2. Type or scan part code\n3. Press **Enter** to load\n4. Press **Tab** (quantity defaults to 1)\n5. Press **Tab** (accept default shipped)\n6. Repeat for next line\n\n### Field Auto-Selection\n\nWhen you click in quantity, shipped, or price fields, the entire value is automatically selected. This allows you to:\n\n* Type a new value to replace the old one completely\n* Press Delete to clear the field\n* Start typing immediately without selecting text first\n\n## Troubleshooting\n\n### Line Item Won't Save\n\n**Check these items**:\n\n* Is the order in a saved state? (Check for ORDER\\_NUMBER)\n* Are you on a line marked as \"Auto Load\"?\n* Is the order type editable? (Voided and Posted orders cannot be edited)\n* Do you have the correct permissions?\n\n### Stock Quantity Not Updating\n\n**Try these steps**:\n\n1. Refresh the order to reload inventory data\n2. Verify the correct location is selected\n3. Check if the part is marked \"Do Not Adjust On-Hand\"\n4. Confirm inventory was updated in the inventory module\n\n### Price Not Applying Correctly\n\n**Verify**:\n\n* Is a price code applied? (Check Discount column)\n* Does the customer have a default price code?\n* Is the price code still valid? (Check date range)\n* Has the inventory record's price been updated?\n\n### Search Modal Not Finding Parts\n\n**Common causes**:\n\n* Part doesn't exist at your current location\n* Part is discontinued with zero stock\n* Search terms don't match any indexed fields\n* Inventory cache needs refresh\n\n**Solution**: Try searching by part code directly, or check the inventory module to verify the part exists.\n\n## Best Practices\n\n### Order Entry Efficiency\n\n1. **Use Tab Navigation**: Keep your hands on the keyboard by using Tab to move between fields.\n\n2. **Leverage Search**: When unsure of exact part codes, use the search modal with partial terms.\n\n3. **Batch Similar Items**: Add all line items before adjusting quantities or prices.\n\n4. **Review Stock First**: For large orders, check stock availability in the inventory module before creating the order.\n\n5. **Save Frequently**: The system auto-saves line items, but major changes trigger saves. Don't rely on manual save buttons.\n\n### Avoiding Common Mistakes\n\n1. **Don't Mix Up Quantity and Shipped**: For Sales Orders/Invoices, these are different fields. Quantity is ordered, Shipped is fulfilled.\n\n2. **Check Location First**: Ensure you're in the correct location before adding parts. Stock quantities are location-specific.\n\n3. **Verify Part Numbers**: Small typos in part codes can load the wrong item. Always verify the product name after loading.\n\n4. **Use Price Codes Properly**: Apply price codes before finalizing quantities to ensure correct pricing.\n\n5. **Note Serial Requirements**: Check if parts require serial numbers before setting shipped quantities. You'll need to assign serials before finalizing.\n\n### Data Quality\n\n1. **Maintain Clean Descriptions**: Even though descriptions are editable, keep them clear and consistent.\n\n2. **Document Custom Items**: For line items without part numbers, include detailed descriptions for future reference.\n\n3. **Track Backorders**: Use the backorder quantity to maintain accurate fulfillment records.\n\n4. **Review Before Finalizing**: Double-check quantities, prices, and stock availability before converting to invoices.\n\n## Related Topics\n\n* [Order View Overview](/docs/store/orders/order-view-overview) - Understanding the Order View interface and order types\n* [Customer Management](/docs/store/orders/customer-management) - Managing customer information in orders\n* [Inventory](/docs/store/inventory) - Managing parts and stock levels\n\n{/* Additional documentation coming soon: Serial Number Management, Price Codes, and AppleCare Integration */}\n",
    "_searchMeta": {
      "cleanContent": "line items represent individual products or parts added to an order each line item contains product details pricing quantities and inventory information this guide covers how to add edit and manage line items in your orders overview what are line items line items are the individual products or parts within an order each line item includes: part number: unique identifier for the product description: product name and details quantity: amount ordered shipped quantity: amount fulfilled price: unit and extended pricing stock information: available inventory backorder status: items on backorder line item table columns column description-------- -------------line sequential line number auto-assigned part search part number entry field with inventory searchdescription product name and description editable quantity amount orderedshipped amount fulfilled shippedstock on-hand quantity at current locationbackorder items on backorder appears as gray badge discount price code discount link when applicable no tax tax exemption toggleprice unit priceextended total price quantity price actions line item menu serial numbers delete adding line items method 1: manual part number entry quick tip: the part number field is case-insensitive abc123 and abc123 will find the same part method 2: scanning part codes method 3: searching inventory search behavior: the search automatically excludes discontinued parts unless they have stock available this prevents adding parts that cannot be fulfilled method 4: manual entry without part number you can add line items without a part number for custom or one-off items: important: line items without part numbers: do not adjust inventory do not check stock availability cannot have serial numbers assigned may require manual tax calculation editing line items changing quantities changing shipped quantities for sales orders and invoices you can adjust how many items are fulfilled: validation rules: shipped quantity cannot exceed ordered quantity for items requiring inventory adjustment shipped quantity cannot exceed available stock the system shows an inventory mismatch modal if you try to ship more than available editing descriptions applying discounts when a part has available price codes a discount link appears in the discount column: price code inheritance: if a customer has a default price code it s automatically applied to new line items you can override it with a different code using the discount link toggling tax status inventory integration stock quantity display the stock column shows the on-hand quantity at your current location this updates in real-time when: adding a new part changing locations after other orders are processed inventory mismatch handling when you try to ship more items than available stock the system displays an inventory mismatch modal: example scenario: customer orders 10 units quantity: 10 you have 6 in stock stock: 6 system calculates: 4 units not stocked solution: set shipped: 6 set backorder: 4 quantity remains: 10 click continue stock update modal when converting an order e g quote to sales order you may see the update from stock modal: recommended: use yes when converting quotes to orders then manually adjust any lines that need special handling this ensures shipped quantities reflect current inventory multiple location support if you switch locations while editing an order: stock quantities refresh for the new location previously loaded parts show updated on-hand amounts the system validates quantities against the new location s inventory line item actions removing line items important: deleting a line item: cannot be undone removes associated serial numbers deletes auto-loaded applecare coverage if applicable updates inventory allocations immediately managing serial numbers for parts that require serial number tracking the actions menu includes a serials option when serials appear: the serials option only appears for: parts marked as requiring serial numbers in inventory sales orders and invoices not worksheets or quotes lines with a shipped quantity greater than 0 applecare management for apple products eligible for applecare the actions menu includes an applecare option understanding line item fields part number vs description part number: immutable once saved must match an inventory record unless blank product name description: editable even after loading from inventory use for custom notes or variations price fields unit price: loaded from inventory record can be overridden with price codes editable only for line items without a part number extended price: automatically calculated as quantity unit price updates in real-time when quantity or price changes shown in bold in the extended column quantity vs shipped quantity: total amount ordered by the customer shipped: amount being fulfilled in this transaction backorder: calculated as quantity - shipped shown in backorder column worksheet quote behavior: shipped always equals quantity no backorders sales order invoice behavior: shipped can be less than quantity creating backorders cost vs price cost: your cost from vendor not visible in line item table price: selling price to customer visible in price column list price: msrp or retail price stored but not displayed validation and error handling common validation errors part not found cause: the part number doesn t exist in inventory at your current location solution: double-check the part code spelling verify the part exists in your location s inventory use the inventory search modal to browse available parts add the part to inventory first if it s a new item inventory mismatch cause: trying to ship more items than available in stock solution: use the inventory mismatch modal to balance shipped and backorder quantities reduce the shipped quantity to match available stock increase backorder quantity to account for the shortage verify stock levels in the inventory module shipped quantity exceeds ordered quantity cause: the number in the shipped field is greater than the quantity field solution: reduce shipped quantity to match or be less than the ordered quantity increase the ordered quantity if the customer wants more items check for data entry errors empty value cannot be updated cause: attempting to save a line with blank required fields solution: enter a quantity value cannot be blank for custom items ensure description and price are filled in use 0 for shipped if no items are being fulfilled yet applecare parts can t be modified cause: trying to edit an auto-loaded applecare line item solution: applecare lines are auto-generated and protected from editing modify the parent device line item instead use the applecare action menu to adjust coverage delete and re-add the parent item if major changes are needed error recovery undoing quantity changes if you enter an invalid quantity: recovering from loading errors if a part fails to load: special line item types applecare products applecare line items are automatically added when you configure coverage for eligible devices: characteristics: cannot be manually edited quantity price description locked linked to a parent device line item automatically deleted if parent device is removed show applecare parts can t be modified tooltip when clicked management: use the applecare action menu on the parent device to modify coverage parts not in inventory line items without a part number: characteristics: price field becomes editable no stock quantity shown no inventory adjustments occur cannot have serial numbers useful for services one-time items or special orders best practice: add a detailed description since there s no inventory record to reference discontinued parts with stock discontinued parts appear in search results only if stock is available: characteristics: can be added to orders while stock lasts stock quantity is accurate may have limited or no pricing information description may indicate discontinued recommendation: notify customers that the part is discontinued and may not be available for future orders keyboard shortcuts and quick actions navigation tab: move to next field and trigger save for quantities shift tab: move to previous field enter: load part number in part field only escape: close search modal quick entry workflow for fast order entry use this pattern: click part number field type or scan part code press enter to load press tab quantity defaults to 1 press tab accept default shipped repeat for next line field auto-selection when you click in quantity shipped or price fields the entire value is automatically selected this allows you to: type a new value to replace the old one completely press delete to clear the field start typing immediately without selecting text first troubleshooting line item won t save check these items: is the order in a saved state check for order _number are you on a line marked as auto load is the order type editable voided and posted orders cannot be edited do you have the correct permissions stock quantity not updating try these steps: refresh the order to reload inventory data verify the correct location is selected check if the part is marked do not adjust on-hand confirm inventory was updated in the inventory module price not applying correctly verify: is a price code applied check discount column does the customer have a default price code is the price code still valid check date range has the inventory record s price been updated search modal not finding parts common causes: part doesn t exist at your current location part is discontinued with zero stock search terms don t match any indexed fields inventory cache needs refresh solution: try searching by part code directly or check the inventory module to verify the part exists best practices order entry efficiency use tab navigation: keep your hands on the keyboard by using tab to move between fields leverage search: when unsure of exact part codes use the search modal with partial terms batch similar items: add all line items before adjusting quantities or prices review stock first: for large orders check stock availability in the inventory module before creating the order save frequently: the system auto-saves line items but major changes trigger saves don t rely on manual save buttons avoiding common mistakes don t mix up quantity and shipped: for sales orders invoices these are different fields quantity is ordered shipped is fulfilled check location first: ensure you re in the correct location before adding parts stock quantities are location-specific verify part numbers: small typos in part codes can load the wrong item always verify the product name after loading use price codes properly: apply price codes before finalizing quantities to ensure correct pricing note serial requirements: check if parts require serial numbers before setting shipped quantities you ll need to assign serials before finalizing data quality maintain clean descriptions: even though descriptions are editable keep them clear and consistent document custom items: for line items without part numbers include detailed descriptions for future reference track backorders: use the backorder quantity to maintain accurate fulfillment records review before finalizing: double-check quantities prices and stock availability before converting to invoices related topics order view overview - understanding the order view interface and order types customer management - managing customer information in orders inventory - managing parts and stock levels additional documentation coming soon: serial number management price codes and applecare integration",
      "headings": [
        "Overview",
        "Adding Line Items",
        "Editing Line Items",
        "Inventory Integration",
        "Line Item Actions",
        "Understanding Line Item Fields",
        "Validation and Error Handling",
        "Special Line Item Types",
        "Keyboard Shortcuts and Quick Actions",
        "Troubleshooting",
        "Best Practices",
        "Related Topics"
      ],
      "keywords": [
        "line items",
        "order items",
        "inventory",
        "pricing",
        "quantities",
        "parts",
        "stock",
        "backorder",
        "Overview",
        "Adding Line Items",
        "Editing Line Items",
        "Inventory Integration",
        "Line Item Actions",
        "Understanding Line Item Fields",
        "Validation and Error Handling",
        "Special Line Item Types",
        "Keyboard Shortcuts and Quick Actions",
        "Troubleshooting",
        "Best Practices",
        "Related Topics",
        "Part Number",
        "Description",
        "Quantity",
        "Shipped Quantity",
        "Price",
        "Stock Information",
        "Backorder Status",
        "Line #",
        "Part / Search",
        "Shipped",
        "Stock",
        "Backorder",
        "Discount",
        "No Tax",
        "Extended",
        "Actions",
        "Quick Tip",
        "Search Behavior",
        "Important",
        "Validation Rules",
        "Price Code Inheritance",
        "Inventory Mismatch",
        "Example Scenario",
        "Solution",
        "Update from Stock",
        "Recommended",
        "Serials",
        "When Serials Appear",
        "AppleCare",
        "Product Name/Description",
        "Unit Price",
        "Extended Price",
        "Worksheet/Quote Behavior",
        "Sales Order/Invoice Behavior",
        "Cost",
        "List Price",
        "Cause",
        "Characteristics",
        "Management",
        "Best Practice",
        "Recommendation",
        "Tab",
        "Shift+Tab",
        "Enter",
        "Escape",
        "Check these items",
        "Try these steps",
        "Verify",
        "Common causes",
        "Use Tab Navigation",
        "Leverage Search",
        "Batch Similar Items",
        "Review Stock First",
        "Save Frequently",
        "Don't Mix Up Quantity and Shipped",
        "Check Location First",
        "Verify Part Numbers",
        "Use Price Codes Properly",
        "Note Serial Requirements",
        "Maintain Clean Descriptions",
        "Document Custom Items",
        "Track Backorders",
        "Review Before Finalizing"
      ]
    }
  },
  {
    "slug": "/store/orders/order-table",
    "title": "Order Table",
    "description": "Browse, search, and manage orders in the Weevio Store order list view.",
    "content": "The Order Table provides a comprehensive view of all your orders, invoices, sales orders, quotes, and worksheets in one centralized location. This powerful interface allows you to quickly browse, search, filter, and manage your order data.\n\n{/* Screenshot: Order table main view showing the data grid with multiple orders */}\n\n## Overview\n\nThe Order Table is your primary interface for viewing and managing all order-related transactions. It displays orders from your PIMS system in an easy-to-navigate data grid with advanced filtering, sorting, and search capabilities.\n\n### Key Features\n\n* **Real-time data synchronization** with PIMS\n* **Advanced filtering** by order type, date range, and custom criteria\n* **Quick search** across all order fields\n* **Column customization** to show only the data you need\n* **Bulk operations** and data export\n* **Automatic caching** for offline access\n* **Dynamic totals** that update based on filtered results\n\n## Interface Layout\n\nThe Order Table interface consists of several key sections:\n\n### Navigation Bar\n\nLocated at the top of the screen, the navigation bar includes:\n\n* **Refresh button**: Manually refresh order data from PIMS\n* **Date range picker**: Filter orders by date\n* **Quick search**: Search across all order fields\n* **New Order button**: Create a new order\n\n### Left Sidebar\n\nThe sidebar provides quick access to order type filters:\n\n* **All Orders**: View all order types together\n* **Invoices**: Filter to show only invoices (paid customer orders)\n* **Sales Orders**: Filter to show only sales orders (confirmed but not yet invoiced)\n* **Quotes**: Filter to show only quotes (price estimates)\n* **Worksheets**: Filter to show only worksheets (work in progress)\n\n{/* Screenshot: Left sidebar showing order type filters */}\n\n### Data Grid\n\nThe main data grid displays your orders with the following columns:\n\n| Column | Description |\n|--------|-------------|\n| **Lock Icon** | Indicates if the order can be edited (unlocked) or is read-only (locked) |\n| **Order #** | Unique order identifier from PIMS |\n| **Date** | Order creation date (MM/DD/YY format) |\n| **Customer Name** | Name of the customer associated with the order |\n| **Salesperson** | Salesperson code assigned to the order |\n| **PO #** | Customer purchase order number (if provided) |\n| **Total** | Order grand total in USD currency format |\n| **Type** | Order type with color-coded label (Invoice, Sales Order, Quote, or Worksheet) |\n| **Actions** | Available actions for the order (e.g., View Customer) |\n\n### Footer\n\nThe footer displays aggregate information:\n\n* **Order Count**: Number of orders currently visible (after filters applied)\n* **Total**: Sum of all visible order totals\n\n## Understanding Order Status\n\n### Order Types\n\nOrders are categorized into four main types, each with a distinct color-coded label:\n\n**Invoice** (Blue Label)\n\n* Represents a completed, invoiced sale\n* Customer has been billed for products/services\n* May be locked if payment has been processed\n\n**Sales Order** (Yellow Label)\n\n* Confirmed order that has not yet been invoiced\n* Customer commitment to purchase\n* Can be converted to an invoice\n\n**Quote** (Green Label)\n\n* Price estimate provided to a customer\n* Not yet committed or confirmed\n* Can be converted to a sales order or invoice\n\n**Worksheet** (White Label with Black Border)\n\n* Work in progress\n* Often used for service/repair work\n* Can be converted to other order types\n\n{/* Screenshot: Order type labels showing different colors */}\n\n### Lock Status\n\nEach order displays a lock icon indicating its edit status:\n\n* **Unlocked (Green)**: Order can be edited and modified\n* **Locked (Gray)**: Order is read-only for one of these reasons:\n  * Invoice has been paid (has a payment type assigned)\n  * Order has been voided\n\n## Search & Filtering\n\n### Text Search\n\nThe Order Table offers two search methods:\n\n**Navbar Search** (Top of page)\n\n* Searches across all order fields\n* Useful for finding specific orders by customer name, order number, or other details\n* Updates results as you type\n\n**Data Grid Quick Filter** (In the toolbar)\n\n* Filters visible rows in the table\n* Searches across all columns simultaneously\n* Useful for narrowing down already-loaded orders\n* Supports multiple search terms separated by spaces\n\n{/* Screenshot: Search functionality in action */}\n\n### Date Range Filtering\n\nFilter orders by creation date:\n\n1. Click the **date range picker** in the navigation bar\n2. Select a start date and end date\n3. Orders will automatically filter to show only those within the selected range\n4. Click the **Reset** button to clear the date filter\n\n**Default Behavior**: When no date range is selected, the system loads orders from the past 365 days.\n\n**Single Date Selection**: If you select only one date, the system will show orders from one day before to one day after that date.\n\n### Order Type Filtering\n\nFilter by specific order types using the left sidebar:\n\n1. Click on any order type in the sidebar:\n   * **Invoices**\n   * **Sales Orders**\n   * **Quotes**\n   * **Worksheets**\n2. The data grid will update to show only orders of the selected type\n3. Click **All Orders** to remove the filter and view all order types\n\n**Tip**: The quick filter in the data grid toolbar automatically updates when you select an order type from the sidebar.\n\n## Data Grid Features\n\n### Sorting\n\nSort any column by clicking on the column header:\n\n* **First click**: Sorts ascending\n* **Second click**: Sorts descending\n* **Third click**: Returns to default sort (by order date, newest first)\n\n### Column Management\n\nCustomize which columns are visible:\n\n1. Click the **Columns** button in the data grid toolbar\n2. Check or uncheck columns to show or hide them\n3. Drag column headers to reorder them\n4. Your column preferences are saved automatically\n\n{/* Screenshot: Column management dialog */}\n\n### Advanced Filtering\n\nAccess advanced filter options:\n\n1. Click the **Filters** button in the data grid toolbar\n2. Add filter rules for specific columns\n3. Combine multiple filters with AND/OR logic\n4. Filter by text, numbers, dates, and more\n\n### Pagination\n\nThe Order Table loads up to 2,500 orders at a time. Use the pagination controls at the bottom of the grid to:\n\n* Navigate between pages\n* Change the number of rows displayed per page\n* Jump to a specific page\n\n### Export Data\n\nExport your filtered order data:\n\n1. Apply any desired filters (date range, order type, quick filter)\n2. Click the menu icon (⋮) in the data grid toolbar\n3. Select **Export** > **Download as CSV** or **Print**\n4. The export will include only the currently visible/filtered orders\n\n## Actions\n\n### Viewing an Order\n\nTo open an order in detail view:\n\n* **Click anywhere on the order row** (except action buttons)\n* The order opens in a new window/tab\n* You can edit the order if it's unlocked\n\n### Viewing Customer Details\n\nTo view the customer associated with an order:\n\n1. Locate the **Actions** column for the order\n2. Click the **View Customer** button\n3. The customer record opens in a new window/tab\n\n### Creating a New Order\n\nTo create a new order:\n\n1. Click the **Order** button in the navigation bar\n2. A new order form opens\n3. Fill in customer information and line items\n4. Save the order\n\n## Performance & Caching\n\n### Automatic Caching\n\nThe Order Table automatically caches order data to improve performance:\n\n* **Initial load**: Data is fetched from PIMS and cached locally\n* **Subsequent loads**: Cached data displays immediately while fresh data loads in the background\n* **Offline access**: View cached orders even when PIMS is unavailable\n* **Cache refresh**: Data refreshes automatically when you return to the Orders page\n\n### Sample Data Mode\n\nFor demonstration or training purposes, you can enable sample data mode:\n\n* Sample orders are loaded instead of real PIMS data\n* Useful for testing filters and exploring features without affecting real data\n* Sample data is indicated by a banner notification\n\n**Note**: Sample data mode is typically accessed through developer/admin settings.\n\n### Offline Capabilities\n\nWhen PIMS is unavailable:\n\n* The most recently cached order data remains available\n* You can still search, filter, and view cached orders\n* A notification appears indicating the connection status\n* Click the notification to retry the connection\n* New orders or changes cannot be saved while offline\n\n## Data Refresh\n\n### Automatic Refresh\n\nThe Order Table automatically refreshes when:\n\n* You return to the Orders page after viewing another page\n* The browser window regains focus after being inactive\n* You switch between order type filters\n\n### Manual Refresh\n\nTo manually refresh order data:\n\n1. Click the **Refresh** icon in the navigation bar\n2. The loading indicator appears while data is being fetched\n3. The table updates with the latest data from PIMS\n\n**Note**: Search and filter settings are preserved during manual refresh.\n\n## Tips & Best Practices\n\n### Efficient Order Searching\n\n* **Use date ranges**: Always filter by date range first to reduce the dataset\n* **Combine filters**: Use order type filter + quick search for fastest results\n* **Search by order number**: Type the full order number in quick search for instant results\n* **Sort by relevant columns**: Sort by date, customer name, or total based on your task\n\n### Understanding Totals\n\n* The **footer total** reflects only the visible/filtered orders\n* Use this to quickly calculate totals for specific order types or date ranges\n* Export filtered data to Excel for more complex calculations\n\n### Managing Large Order Lists\n\nWhen working with many orders:\n\n1. Start with a narrow date range (e.g., current month)\n2. Apply order type filters to further reduce results\n3. Use column sorting to prioritize important orders\n4. Hide unnecessary columns to focus on key data\n5. Increase rows per page to see more orders at once\n\n### Locked Orders\n\nIf you need to edit a locked order:\n\n* **Paid invoices**: Contact your PIMS administrator about payment reversal procedures\n* **Voided orders**: Voided orders cannot be unvoided; create a new order instead\n\n## Troubleshooting\n\n### Orders Not Loading\n\nIf orders don't appear:\n\n1. **Check your PIMS connection**: Look for connection error notifications\n2. **Verify location settings**: Ensure your PIMS location code is configured correctly\n3. **Check date range**: Expand the date range to include older orders\n4. **Clear filters**: Reset all filters and try again\n5. **Refresh manually**: Click the refresh button\n6. **Check permissions**: Ensure the Orders module is enabled for your account\n\n### Missing Orders\n\nIf expected orders are missing:\n\n* **Check date range**: The default range is 365 days; older orders require custom date selection\n* **Verify order type filter**: Clear the order type filter to view all types\n* **Check location**: Orders are filtered by your current PIMS location\n* **Review search filters**: Clear all quick filters and advanced filters\n\n### Slow Performance\n\nIf the Order Table loads slowly:\n\n* **Reduce date range**: Narrow your date range to fewer days\n* **Close other tabs**: Close other Weevio Cloud tabs to free up resources\n* **Check internet connection**: Slow connections affect PIMS data loading\n* **Clear browser cache**: Old cached data can sometimes cause issues\n\n### Export Issues\n\nIf export doesn't work:\n\n* **Check browser pop-up blocker**: Allow pop-ups for Weevio Cloud\n* **Reduce dataset**: Filter to fewer orders before exporting\n* **Try different format**: Try CSV if Print doesn't work, or vice versa\n\n## Related Topics\n\n* [Creating Orders](/docs/store/orders/creating-orders) - Learn how to create new orders\n* [Order Details](/docs/store/orders/order-details) - Understanding the order detail view\n* [Service Repair Orders (SROs)](/docs/store/sros) - Managing service and repair work\n* [Customers](/docs/store/customers) - Managing customer records\n* [Invoice Payments](/docs/customer-portal/invoice-payments) - Processing invoice payments\n",
    "_searchMeta": {
      "cleanContent": "the order table provides a comprehensive view of all your orders invoices sales orders quotes and worksheets in one centralized location this powerful interface allows you to quickly browse search filter and manage your order data screenshot: order table main view showing the data grid with multiple orders overview the order table is your primary interface for viewing and managing all order-related transactions it displays orders from your pims system in an easy-to-navigate data grid with advanced filtering sorting and search capabilities key features real-time data synchronization with pims advanced filtering by order type date range and custom criteria quick search across all order fields column customization to show only the data you need bulk operations and data export automatic caching for offline access dynamic totals that update based on filtered results interface layout the order table interface consists of several key sections: navigation bar located at the top of the screen the navigation bar includes: refresh button: manually refresh order data from pims date range picker: filter orders by date quick search: search across all order fields new order button: create a new order left sidebar the sidebar provides quick access to order type filters: all orders: view all order types together invoices: filter to show only invoices paid customer orders sales orders: filter to show only sales orders confirmed but not yet invoiced quotes: filter to show only quotes price estimates worksheets: filter to show only worksheets work in progress screenshot: left sidebar showing order type filters data grid the main data grid displays your orders with the following columns: column description-------- -------------lock icon indicates if the order can be edited unlocked or is read-only locked order unique order identifier from pimsdate order creation date mm dd yy format customer name name of the customer associated with the ordersalesperson salesperson code assigned to the orderpo customer purchase order number if provided total order grand total in usd currency formattype order type with color-coded label invoice sales order quote or worksheet actions available actions for the order e g view customer footer the footer displays aggregate information: order count: number of orders currently visible after filters applied total: sum of all visible order totals understanding order status order types orders are categorized into four main types each with a distinct color-coded label: invoice blue label represents a completed invoiced sale customer has been billed for products services may be locked if payment has been processed sales order yellow label confirmed order that has not yet been invoiced customer commitment to purchase can be converted to an invoice quote green label price estimate provided to a customer not yet committed or confirmed can be converted to a sales order or invoice worksheet white label with black border work in progress often used for service repair work can be converted to other order types screenshot: order type labels showing different colors lock status each order displays a lock icon indicating its edit status: unlocked green : order can be edited and modified locked gray : order is read-only for one of these reasons: invoice has been paid has a payment type assigned order has been voided search filtering text search the order table offers two search methods: navbar search top of page searches across all order fields useful for finding specific orders by customer name order number or other details updates results as you type data grid quick filter in the toolbar filters visible rows in the table searches across all columns simultaneously useful for narrowing down already-loaded orders supports multiple search terms separated by spaces screenshot: search functionality in action date range filtering filter orders by creation date: click the date range picker in the navigation bar select a start date and end date orders will automatically filter to show only those within the selected range click the reset button to clear the date filter default behavior: when no date range is selected the system loads orders from the past 365 days single date selection: if you select only one date the system will show orders from one day before to one day after that date order type filtering filter by specific order types using the left sidebar: click on any order type in the sidebar: invoices sales orders quotes worksheets the data grid will update to show only orders of the selected type click all orders to remove the filter and view all order types tip: the quick filter in the data grid toolbar automatically updates when you select an order type from the sidebar data grid features sorting sort any column by clicking on the column header: first click: sorts ascending second click: sorts descending third click: returns to default sort by order date newest first column management customize which columns are visible: click the columns button in the data grid toolbar check or uncheck columns to show or hide them drag column headers to reorder them your column preferences are saved automatically screenshot: column management dialog advanced filtering access advanced filter options: click the filters button in the data grid toolbar add filter rules for specific columns combine multiple filters with and or logic filter by text numbers dates and more pagination the order table loads up to 2 500 orders at a time use the pagination controls at the bottom of the grid to: navigate between pages change the number of rows displayed per page jump to a specific page export data export your filtered order data: apply any desired filters date range order type quick filter click the menu icon in the data grid toolbar select export download as csv or print the export will include only the currently visible filtered orders actions viewing an order to open an order in detail view: click anywhere on the order row except action buttons the order opens in a new window tab you can edit the order if it s unlocked viewing customer details to view the customer associated with an order: locate the actions column for the order click the view customer button the customer record opens in a new window tab creating a new order to create a new order: click the order button in the navigation bar a new order form opens fill in customer information and line items save the order performance caching automatic caching the order table automatically caches order data to improve performance: initial load: data is fetched from pims and cached locally subsequent loads: cached data displays immediately while fresh data loads in the background offline access: view cached orders even when pims is unavailable cache refresh: data refreshes automatically when you return to the orders page sample data mode for demonstration or training purposes you can enable sample data mode: sample orders are loaded instead of real pims data useful for testing filters and exploring features without affecting real data sample data is indicated by a banner notification note: sample data mode is typically accessed through developer admin settings offline capabilities when pims is unavailable: the most recently cached order data remains available you can still search filter and view cached orders a notification appears indicating the connection status click the notification to retry the connection new orders or changes cannot be saved while offline data refresh automatic refresh the order table automatically refreshes when: you return to the orders page after viewing another page the browser window regains focus after being inactive you switch between order type filters manual refresh to manually refresh order data: click the refresh icon in the navigation bar the loading indicator appears while data is being fetched the table updates with the latest data from pims note: search and filter settings are preserved during manual refresh tips best practices efficient order searching use date ranges: always filter by date range first to reduce the dataset combine filters: use order type filter quick search for fastest results search by order number: type the full order number in quick search for instant results sort by relevant columns: sort by date customer name or total based on your task understanding totals the footer total reflects only the visible filtered orders use this to quickly calculate totals for specific order types or date ranges export filtered data to excel for more complex calculations managing large order lists when working with many orders: start with a narrow date range e g current month apply order type filters to further reduce results use column sorting to prioritize important orders hide unnecessary columns to focus on key data increase rows per page to see more orders at once locked orders if you need to edit a locked order: paid invoices: contact your pims administrator about payment reversal procedures voided orders: voided orders cannot be unvoided create a new order instead troubleshooting orders not loading if orders don t appear: check your pims connection: look for connection error notifications verify location settings: ensure your pims location code is configured correctly check date range: expand the date range to include older orders clear filters: reset all filters and try again refresh manually: click the refresh button check permissions: ensure the orders module is enabled for your account missing orders if expected orders are missing: check date range: the default range is 365 days older orders require custom date selection verify order type filter: clear the order type filter to view all types check location: orders are filtered by your current pims location review search filters: clear all quick filters and advanced filters slow performance if the order table loads slowly: reduce date range: narrow your date range to fewer days close other tabs: close other weevio cloud tabs to free up resources check internet connection: slow connections affect pims data loading clear browser cache: old cached data can sometimes cause issues export issues if export doesn t work: check browser pop-up blocker: allow pop-ups for weevio cloud reduce dataset: filter to fewer orders before exporting try different format: try csv if print doesn t work or vice versa related topics creating orders - learn how to create new orders order details - understanding the order detail view service repair orders sros - managing service and repair work customers - managing customer records invoice payments - processing invoice payments",
      "headings": [
        "Overview",
        "Interface Layout",
        "Understanding Order Status",
        "Search & Filtering",
        "Data Grid Features",
        "Actions",
        "Performance & Caching",
        "Data Refresh",
        "Tips & Best Practices",
        "Troubleshooting",
        "Related Topics"
      ],
      "keywords": [
        "orders",
        "order list",
        "search",
        "filtering",
        "order management",
        "invoices",
        "sales orders",
        "quotes",
        "worksheets",
        "Overview",
        "Interface Layout",
        "Understanding Order Status",
        "Search & Filtering",
        "Data Grid Features",
        "Actions",
        "Performance & Caching",
        "Data Refresh",
        "Tips & Best Practices",
        "Troubleshooting",
        "Related Topics",
        "Real-time data synchronization",
        "Advanced filtering",
        "Quick search",
        "Column customization",
        "Bulk operations",
        "Automatic caching",
        "Dynamic totals",
        "Refresh button",
        "Date range picker",
        "New Order button",
        "All Orders",
        "Invoices",
        "Sales Orders",
        "Quotes",
        "Worksheets",
        "Lock Icon",
        "Order #",
        "Date",
        "Customer Name",
        "Salesperson",
        "PO #",
        "Total",
        "Type",
        "Order Count",
        "Invoice",
        "Sales Order",
        "Quote",
        "Worksheet",
        "Unlocked (Green)",
        "Locked (Gray)",
        "Navbar Search",
        "Data Grid Quick Filter",
        "date range picker",
        "Reset",
        "Default Behavior",
        "Single Date Selection",
        "Tip",
        "First click",
        "Second click",
        "Third click",
        "Columns",
        "Filters",
        "Export",
        "Download as CSV",
        "Print",
        "Click anywhere on the order row",
        "View Customer",
        "Order",
        "Initial load",
        "Subsequent loads",
        "Offline access",
        "Cache refresh",
        "Note",
        "Refresh",
        "Use date ranges",
        "Combine filters",
        "Search by order number",
        "Sort by relevant columns",
        "footer total",
        "Paid invoices",
        "Voided orders",
        "Check your PIMS connection",
        "Verify location settings",
        "Check date range",
        "Clear filters",
        "Refresh manually",
        "Check permissions",
        "Verify order type filter",
        "Check location",
        "Review search filters",
        "Reduce date range",
        "Close other tabs",
        "Check internet connection",
        "Clear browser cache",
        "Check browser pop-up blocker",
        "Reduce dataset",
        "Try different format"
      ]
    }
  },
  {
    "slug": "/store/orders/order-view-overview",
    "title": "Order View Overview",
    "description": "Understanding the Order View interface for creating and editing orders in Weevio Store.",
    "content": "The **Order View** is the primary interface for creating and editing all types of orders in Weevio Store. Whether you're creating a quick worksheet, generating a quote, processing an invoice, or managing a sales order, this unified interface provides all the tools you need.\n\n## What is the Order View?\n\nThe Order View is a comprehensive order management interface that allows you to:\n\n* Create new orders from scratch or edit existing orders\n* Switch between order types (Worksheet, Quote, Sales Order, Invoice)\n* Manage customer information (billing and shipping)\n* Add and configure line items with pricing, discounts, and serial numbers\n* Process payments and finalize invoices\n* Configure shipping and dropship options\n* Track order totals including tax, shipping, and discounts\n\n## Interface Layout\n\nThe Order View is organized into distinct sections to streamline your workflow:\n\n### 1. Order Header\n\nLocated at the top of the interface, the order header displays:\n\n* **Order Number**: Auto-generated unique identifier (click to copy)\n* **Order Type**: Visual indicator showing current order type with color coding:\n  * **Worksheet** (white): Draft orders for internal use\n  * **Quote** (green): Customer price quotes\n  * **Sales Order** (yellow): Confirmed orders awaiting fulfillment\n  * **Invoice** (blue): Finalized orders with payment\n  * **Void** (red): Cancelled orders\n* **Salesperson Code**: Employee responsible for the order\n* **PO Number**: Customer's purchase order reference\n* **Reference Number**: Internal reference tracking\n\n### 2. Customer Information Tabs\n\nSwitch between two customer information panels:\n\n* **Customer Billing**: Billing name, address, contact information\n* **Customer Shipping**: Shipping destination, contact details\n* **Quick Actions**: Search customers, view customer records, access shipping locations\n\n### 3. Line Items Table\n\nThe central workspace for adding products and services:\n\n* Product search and autocomplete\n* Quantity, pricing, and discount management\n* Serial number assignment for serialized inventory\n* AppleCare and warranty product association\n* Stock availability indicators\n* Line-level tax exemption controls\n\n### 4. Footer Section\n\nBottom area with order controls:\n\n* **Left Side**: Miscellaneous options (dropship settings, stock adjustments)\n* **Right Side**: Order totals and action buttons\n  * Subtotal, tax, shipping, and grand total\n  * Save/Close button\n  * Print and email options\n\n## Understanding Order Types\n\nOrders in Weevio Store progress through different types based on their lifecycle:\n\n### Worksheet\n\n* **Purpose**: Internal draft orders, planning, and temporary order storage\n* **Characteristics**: No payment required, fully editable, not synced to accounting\n* **Use Case**: Building an order before converting to quote or sales order\n\n### Quote\n\n* **Purpose**: Formal price quotes for customers\n* **Characteristics**: Editable, can be printed/emailed to customers\n* **Use Case**: Providing pricing to prospective customers\n* **Conversion**: Can be converted to Sales Order or Invoice\n\n### Sales Order\n\n* **Purpose**: Confirmed orders awaiting fulfillment or payment\n* **Characteristics**: Editable, tracks inventory commitments\n* **Use Case**: Orders approved but not yet paid\n* **Conversion**: Can be converted to Invoice when ready for payment\n\n### Invoice\n\n* **Purpose**: Finalized orders with payment processed\n* **Characteristics**: Limited editing after payment, creates accounting records\n* **Use Case**: Completed sales transactions\n* **Note**: Once paid, invoices become locked and cannot be converted to other types\n\n## Core Workflows\n\n### Creating a New Order\n\n### Editing an Existing Order\n\n<Note type=\"note\">\n  Paid invoices have limited editing capabilities. You cannot modify line items or customer information once payment is processed.\n</Note>\n\n### Converting Order Types\n\nTo convert an order from one type to another:\n\n1. Open the order you want to convert\n2. Click the **Order Type** dropdown in the header\n3. Select the new order type\n4. Confirm the conversion when prompted\n5. The system will validate the conversion and update the order\n\n**Common conversions:**\n\n* Worksheet → Quote → Sales Order → Invoice (typical sales flow)\n* Quote → Invoice (direct sale from quote)\n* Sales Order → Worksheet (downgrade if order is cancelled)\n\n## Navigation and Controls\n\n### Keyboard Shortcuts\n\n* **Tab**: Move to next field\n* **Shift + Tab**: Move to previous field\n* **Enter**: Submit current field and move to next\n* **Esc**: Cancel current modal or popup\n\n### Saving Behavior\n\nThe Order View uses **auto-save** for most changes:\n\n* **Header fields** (PO Number, Reference Number): Save when you leave the field (onBlur)\n* **Line items**: Save when you complete a row or move to another field\n* **Customer information**: Saves automatically when field loses focus\n* **Order type changes**: Save immediately upon conversion\n\n### Closing and Canceling\n\n* **Close Button**: Saves all pending changes and returns to order list\n* **Browser Back**: Not recommended (use Close button instead)\n* **Unsaved Changes**: Auto-saved in real-time, no prompt needed\n\n## Feature Areas Quick Reference\n\nThe Order View includes several specialized features, each documented in detail on their own pages:\n\n{/* Coming soon: Pricing & Discounts, Serial Numbers, Payments, and Shipping & Dropship documentation */}\n\n## Quick Start: Your First Order\n\nReady to create your first order? Here's a simple example:\n\n<Note type=\"success\">\n  Congratulations! You've created your first order. The order is now saved and can be found in your order list.\n</Note>\n\n## Order Workflow Diagram\n\n## Best Practices\n\n### Order Type Selection\n\n* Start with **Worksheets** when building complex orders or quotes\n* Use **Quotes** for formal customer price requests\n* Convert to **Sales Order** when customer confirms but hasn't paid\n* Only use **Invoice** when ready to process payment\n\n### Customer Linking\n\n* Always link a customer for quotes and invoices\n* Customer linking enables:\n  * Customer-specific pricing\n  * Shipping location quick-fill\n  * Order history tracking\n  * Automatic tax calculations\n\n### Line Item Entry\n\n* Use autocomplete to find products quickly\n* Verify stock availability before finalizing\n* Assign serial numbers for serialized items before closing invoices\n* Review pricing carefully when applying discounts\n\n### Payment Processing\n\n* Verify the grand total before processing payment\n* Ensure all serial numbers are assigned (for invoices)\n* Check that customer information is complete\n* Print or email receipt immediately after payment\n\n## Common Scenarios\n\n### Scenario: Walk-in Sale\n\n1. Open new order\n2. Set to \"Invoice\" immediately\n3. Add line items (no customer needed for cash sales)\n4. Process payment\n5. Print receipt\n\n### Scenario: Phone Quote\n\n1. Open new order as \"Quote\"\n2. Search and link customer\n3. Add requested items\n4. Review totals with customer\n5. Email quote PDF\n6. Convert to Sales Order when customer approves\n\n### Scenario: Special Order\n\n1. Create as \"Sales Order\"\n2. Link customer\n3. Add special order items (may show backorder status)\n4. Configure dropship if vendor ships directly\n5. Convert to Invoice when items arrive and customer is ready to pay\n\n## Troubleshooting\n\n### Order Won't Save\n\n* **Check validation**: Ensure salesperson code is valid\n* **Line items**: Verify all line items have valid part numbers\n* **Network**: Confirm you're connected to the internet\n\n### Can't Convert Order Type\n\n* **Paid invoices**: Cannot be converted to other types\n* **Invalid conversions**: Some conversions are restricted (system will explain)\n* **Required fields**: Ensure customer is linked for certain conversions\n\n### Changes Not Appearing\n\n* **Auto-save**: Click outside the field to trigger save\n* **Refresh**: Close and reopen the order to see latest changes\n* **Permissions**: Verify you have edit access to the order\n\n## Next Steps\n\nNow that you understand the Order View interface, dive deeper into specific features:\n\n* **[Customer Management](/docs/store/orders/customer-management)**: Learn advanced customer search and linking\n* **[Line Items](/docs/store/orders/line-items)**: Master product entry and inventory management\n\n{/* Additional documentation coming soon: Pricing & Discounts, Payments, Serial Numbers, and Shipping & Dropship */}\n",
    "_searchMeta": {
      "cleanContent": "the order view is the primary interface for creating and editing all types of orders in weevio store whether you re creating a quick worksheet generating a quote processing an invoice or managing a sales order this unified interface provides all the tools you need what is the order view the order view is a comprehensive order management interface that allows you to: create new orders from scratch or edit existing orders switch between order types worksheet quote sales order invoice manage customer information billing and shipping add and configure line items with pricing discounts and serial numbers process payments and finalize invoices configure shipping and dropship options track order totals including tax shipping and discounts interface layout the order view is organized into distinct sections to streamline your workflow: order header located at the top of the interface the order header displays: order number: auto-generated unique identifier click to copy order type: visual indicator showing current order type with color coding: worksheet white : draft orders for internal use quote green : customer price quotes sales order yellow : confirmed orders awaiting fulfillment invoice blue : finalized orders with payment void red : cancelled orders salesperson code: employee responsible for the order po number: customer s purchase order reference reference number: internal reference tracking customer information tabs switch between two customer information panels: customer billing: billing name address contact information customer shipping: shipping destination contact details quick actions: search customers view customer records access shipping locations line items table the central workspace for adding products and services: product search and autocomplete quantity pricing and discount management serial number assignment for serialized inventory applecare and warranty product association stock availability indicators line-level tax exemption controls footer section bottom area with order controls: left side: miscellaneous options dropship settings stock adjustments right side: order totals and action buttons subtotal tax shipping and grand total save close button print and email options understanding order types orders in weevio store progress through different types based on their lifecycle: worksheet purpose: internal draft orders planning and temporary order storage characteristics: no payment required fully editable not synced to accounting use case: building an order before converting to quote or sales order quote purpose: formal price quotes for customers characteristics: editable can be printed emailed to customers use case: providing pricing to prospective customers conversion: can be converted to sales order or invoice sales order purpose: confirmed orders awaiting fulfillment or payment characteristics: editable tracks inventory commitments use case: orders approved but not yet paid conversion: can be converted to invoice when ready for payment invoice purpose: finalized orders with payment processed characteristics: limited editing after payment creates accounting records use case: completed sales transactions note: once paid invoices become locked and cannot be converted to other types core workflows creating a new order editing an existing order paid invoices have limited editing capabilities you cannot modify line items or customer information once payment is processed converting order types to convert an order from one type to another: open the order you want to convert click the order type dropdown in the header select the new order type confirm the conversion when prompted the system will validate the conversion and update the order common conversions: worksheet quote sales order invoice typical sales flow quote invoice direct sale from quote sales order worksheet downgrade if order is cancelled navigation and controls keyboard shortcuts tab: move to next field shift tab: move to previous field enter: submit current field and move to next esc: cancel current modal or popup saving behavior the order view uses auto-save for most changes: header fields po number reference number : save when you leave the field onblur line items: save when you complete a row or move to another field customer information: saves automatically when field loses focus order type changes: save immediately upon conversion closing and canceling close button: saves all pending changes and returns to order list browser back: not recommended use close button instead unsaved changes: auto-saved in real-time no prompt needed feature areas quick reference the order view includes several specialized features each documented in detail on their own pages: coming soon: pricing discounts serial numbers payments and shipping dropship documentation quick start: your first order ready to create your first order here s a simple example: congratulations you ve created your first order the order is now saved and can be found in your order list order workflow diagram best practices order type selection start with worksheets when building complex orders or quotes use quotes for formal customer price requests convert to sales order when customer confirms but hasn t paid only use invoice when ready to process payment customer linking always link a customer for quotes and invoices customer linking enables: customer-specific pricing shipping location quick-fill order history tracking automatic tax calculations line item entry use autocomplete to find products quickly verify stock availability before finalizing assign serial numbers for serialized items before closing invoices review pricing carefully when applying discounts payment processing verify the grand total before processing payment ensure all serial numbers are assigned for invoices check that customer information is complete print or email receipt immediately after payment common scenarios scenario: walk-in sale open new order set to invoice immediately add line items no customer needed for cash sales process payment print receipt scenario: phone quote open new order as quote search and link customer add requested items review totals with customer email quote pdf convert to sales order when customer approves scenario: special order create as sales order link customer add special order items may show backorder status configure dropship if vendor ships directly convert to invoice when items arrive and customer is ready to pay troubleshooting order won t save check validation: ensure salesperson code is valid line items: verify all line items have valid part numbers network: confirm you re connected to the internet can t convert order type paid invoices: cannot be converted to other types invalid conversions: some conversions are restricted system will explain required fields: ensure customer is linked for certain conversions changes not appearing auto-save: click outside the field to trigger save refresh: close and reopen the order to see latest changes permissions: verify you have edit access to the order next steps now that you understand the order view interface dive deeper into specific features: customer management: learn advanced customer search and linking line items: master product entry and inventory management additional documentation coming soon: pricing discounts payments serial numbers and shipping dropship",
      "headings": [
        "What is the Order View?",
        "Interface Layout",
        "Understanding Order Types",
        "Core Workflows",
        "Navigation and Controls",
        "Feature Areas Quick Reference",
        "Quick Start: Your First Order",
        "Order Workflow Diagram",
        "Best Practices",
        "Common Scenarios",
        "Troubleshooting",
        "Next Steps"
      ],
      "keywords": [
        "order view",
        "order creation",
        "order editing",
        "order workflow",
        "sales order",
        "invoice",
        "worksheet",
        "quote",
        "What is the Order View?",
        "Interface Layout",
        "Understanding Order Types",
        "Core Workflows",
        "Navigation and Controls",
        "Feature Areas Quick Reference",
        "Quick Start: Your First Order",
        "Order Workflow Diagram",
        "Best Practices",
        "Common Scenarios",
        "Troubleshooting",
        "Next Steps",
        "Order View",
        "Order Number",
        "Order Type",
        "Worksheet",
        "Quote",
        "Sales Order",
        "Invoice",
        "Void",
        "Salesperson Code",
        "PO Number",
        "Reference Number",
        "Customer Billing",
        "Customer Shipping",
        "Quick Actions",
        "Left Side",
        "Right Side",
        "Purpose",
        "Characteristics",
        "Use Case",
        "Conversion",
        "Note",
        "Common conversions:",
        "Tab",
        "Shift + Tab",
        "Enter",
        "Esc",
        "auto-save",
        "Header fields",
        "Line items",
        "Customer information",
        "Order type changes",
        "Close Button",
        "Browser Back",
        "Unsaved Changes",
        "Worksheets",
        "Quotes",
        "Check validation",
        "Network",
        "Paid invoices",
        "Invalid conversions",
        "Required fields",
        "Auto-save",
        "Refresh",
        "Permissions",
        "[Customer Management](/docs/store/orders/customer-management)",
        "[Line Items](/docs/store/orders/line-items)"
      ]
    }
  }
]